/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        let mut val = 0;
        for i in 0..(bit_width as usize) {
            if self.get_bit(i + bit_offset) {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub fn set(&mut self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
}
pub const NVENCAPI_MAJOR_VERSION: u32 = 13;
pub const NVENCAPI_MINOR_VERSION: u32 = 0;
pub const NVENCAPI_VERSION: u32 = 13;
pub const NVENC_INFINITE_GOPLENGTH: u32 = 4294967295;
pub const NV_MAX_SEQ_HDR_LEN: u32 = 512;
pub const NV_MAX_TILE_COLS_AV1: u32 = 64;
pub const NV_MAX_TILE_ROWS_AV1: u32 = 64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __uint64_t = ::std::os::raw::c_ulong;
#[doc = " \\struct GUID"]
#[doc = " Abstracts the GUID structure for non-windows platforms."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _GUID {
    #[doc = "< [in]: Specifies the first 8 hexadecimal digits of the GUID."]
    pub Data1: u32,
    #[doc = "< [in]: Specifies the first group of 4 hexadecimal digits."]
    pub Data2: u16,
    #[doc = "< [in]: Specifies the second group of 4 hexadecimal digits."]
    pub Data3: u16,
    #[doc = "< [in]: Array of 8 bytes. The first 2 bytes contain the third group of 4 hexadecimal digits."]
    #[doc = "The remaining 6 bytes contain the final 12 hexadecimal digits."]
    pub Data4: [u8; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
    assert_eq!(
        ::std::mem::size_of::<_GUID>(),
        16usize,
        concat!("Size of: ", stringify!(_GUID))
    );
    assert_eq!(
        ::std::mem::align_of::<_GUID>(),
        4usize,
        concat!("Alignment of ", stringify!(_GUID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_GUID),
            "::",
            stringify!(Data4)
        )
    );
}
#[doc = " \\struct GUID"]
#[doc = " Abstracts the GUID structure for non-windows platforms."]
pub type GUID = _GUID;
#[doc = " \\struct _NVENC_RECT"]
#[doc = " Defines a Rectangle. Used in ::NV_ENC_PREPROCESS_FRAME."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NVENC_RECT {
    #[doc = "< [in]: X coordinate of the upper left corner of rectangular area to be specified."]
    pub left: u32,
    #[doc = "< [in]: Y coordinate of the upper left corner of the rectangular area to be specified."]
    pub top: u32,
    #[doc = "< [in]: X coordinate of the bottom right corner of the rectangular area to be specified."]
    pub right: u32,
    #[doc = "< [in]: Y coordinate of the bottom right corner of the rectangular area to be specified."]
    pub bottom: u32,
}
#[test]
fn bindgen_test_layout__NVENC_RECT() {
    assert_eq!(
        ::std::mem::size_of::<_NVENC_RECT>(),
        16usize,
        concat!("Size of: ", stringify!(_NVENC_RECT))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVENC_RECT>(),
        4usize,
        concat!("Alignment of ", stringify!(_NVENC_RECT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVENC_RECT>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVENC_RECT),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVENC_RECT>())).top as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVENC_RECT),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVENC_RECT>())).right as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVENC_RECT),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NVENC_RECT>())).bottom as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVENC_RECT),
            "::",
            stringify!(bottom)
        )
    );
}
#[doc = " \\struct _NVENC_RECT"]
#[doc = " Defines a Rectangle. Used in ::NV_ENC_PREPROCESS_FRAME."]
pub type NVENC_RECT = _NVENC_RECT;
#[doc = " @}"]
pub type NV_ENC_INPUT_PTR = *mut ::std::os::raw::c_void;
pub type NV_ENC_OUTPUT_PTR = *mut ::std::os::raw::c_void;
pub type NV_ENC_REGISTERED_PTR = *mut ::std::os::raw::c_void;
pub type NV_ENC_CUSTREAM_PTR = *mut ::std::os::raw::c_void;
impl _NV_ENC_PARAMS_FRAME_FIELD_MODE {
    #[doc = "< Frame mode"]
    pub const NV_ENC_PARAMS_FRAME_FIELD_MODE_FRAME: _NV_ENC_PARAMS_FRAME_FIELD_MODE =
        _NV_ENC_PARAMS_FRAME_FIELD_MODE(1);
}
impl _NV_ENC_PARAMS_FRAME_FIELD_MODE {
    #[doc = "< Field mode"]
    pub const NV_ENC_PARAMS_FRAME_FIELD_MODE_FIELD: _NV_ENC_PARAMS_FRAME_FIELD_MODE =
        _NV_ENC_PARAMS_FRAME_FIELD_MODE(2);
}
impl _NV_ENC_PARAMS_FRAME_FIELD_MODE {
    #[doc = "< MB adaptive frame/field"]
    pub const NV_ENC_PARAMS_FRAME_FIELD_MODE_MBAFF: _NV_ENC_PARAMS_FRAME_FIELD_MODE =
        _NV_ENC_PARAMS_FRAME_FIELD_MODE(3);
}
#[repr(transparent)]
#[doc = " Input frame encode modes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_PARAMS_FRAME_FIELD_MODE(pub ::std::os::raw::c_uint);
#[doc = " Input frame encode modes"]
pub use self::_NV_ENC_PARAMS_FRAME_FIELD_MODE as NV_ENC_PARAMS_FRAME_FIELD_MODE;
impl _NV_ENC_PARAMS_RC_MODE {
    #[doc = "< Constant QP mode"]
    pub const NV_ENC_PARAMS_RC_CONSTQP: _NV_ENC_PARAMS_RC_MODE = _NV_ENC_PARAMS_RC_MODE(0);
}
impl _NV_ENC_PARAMS_RC_MODE {
    #[doc = "< Variable bitrate mode"]
    pub const NV_ENC_PARAMS_RC_VBR: _NV_ENC_PARAMS_RC_MODE = _NV_ENC_PARAMS_RC_MODE(1);
}
impl _NV_ENC_PARAMS_RC_MODE {
    #[doc = "< Constant bitrate mode"]
    pub const NV_ENC_PARAMS_RC_CBR: _NV_ENC_PARAMS_RC_MODE = _NV_ENC_PARAMS_RC_MODE(2);
}
#[repr(transparent)]
#[doc = " Rate Control Modes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_PARAMS_RC_MODE(pub ::std::os::raw::c_uint);
#[doc = " Rate Control Modes"]
pub use self::_NV_ENC_PARAMS_RC_MODE as NV_ENC_PARAMS_RC_MODE;
impl _NV_ENC_MULTI_PASS {
    #[doc = "< Single Pass"]
    pub const NV_ENC_MULTI_PASS_DISABLED: _NV_ENC_MULTI_PASS = _NV_ENC_MULTI_PASS(0);
}
impl _NV_ENC_MULTI_PASS {
    #[doc = "< Two Pass encoding is enabled where first Pass is quarter resolution"]
    pub const NV_ENC_TWO_PASS_QUARTER_RESOLUTION: _NV_ENC_MULTI_PASS = _NV_ENC_MULTI_PASS(1);
}
impl _NV_ENC_MULTI_PASS {
    #[doc = "< Two Pass encoding is enabled where first Pass is full resolution"]
    pub const NV_ENC_TWO_PASS_FULL_RESOLUTION: _NV_ENC_MULTI_PASS = _NV_ENC_MULTI_PASS(2);
}
#[repr(transparent)]
#[doc = " Multi Pass encoding"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_MULTI_PASS(pub ::std::os::raw::c_uint);
#[doc = " Multi Pass encoding"]
pub use self::_NV_ENC_MULTI_PASS as NV_ENC_MULTI_PASS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_STATE_RESTORE_TYPE {
    #[doc = "< Restore full encoder state"]
    NV_ENC_STATE_RESTORE_FULL = 1,
    #[doc = "< Restore only rate control state"]
    NV_ENC_STATE_RESTORE_RATE_CONTROL = 2,
    #[doc = "< Restore full encoder state except for rate control state"]
    NV_ENC_STATE_RESTORE_ENCODE = 3,
}
pub use self::_NV_ENC_STATE_RESTORE_TYPE as NV_ENC_STATE_RESTORE_TYPE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_OUTPUT_STATS_LEVEL {
    NV_ENC_OUTPUT_STATS_NONE = 0,
    #[doc = " No output stats"]
    NV_ENC_OUTPUT_STATS_BLOCK_LEVEL = 1,
    #[doc = " Output stats for every block."]
    #[doc = "Block represents a CTB for HEVC, macroblock for H.264, super block for AV1"]
    NV_ENC_OUTPUT_STATS_ROW_LEVEL = 2,
}
pub use self::_NV_ENC_OUTPUT_STATS_LEVEL as NV_ENC_OUTPUT_STATS_LEVEL;
#[repr(u32)]
#[doc = " Emphasis Levels"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_EMPHASIS_MAP_LEVEL {
    #[doc = "< Emphasis Map Level 0, for zero Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_0 = 0,
    #[doc = "< Emphasis Map Level 1, for very low Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_1 = 1,
    #[doc = "< Emphasis Map Level 2, for low Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_2 = 2,
    #[doc = "< Emphasis Map Level 3, for medium Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_3 = 3,
    #[doc = "< Emphasis Map Level 4, for high Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_4 = 4,
    #[doc = "< Emphasis Map Level 5, for very high Delta QP value"]
    NV_ENC_EMPHASIS_MAP_LEVEL_5 = 5,
}
#[doc = " Emphasis Levels"]
pub use self::_NV_ENC_EMPHASIS_MAP_LEVEL as NV_ENC_EMPHASIS_MAP_LEVEL;
#[repr(u32)]
#[doc = " QP MAP MODE"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_QP_MAP_MODE {
    #[doc = "< Value in NV_ENC_PIC_PARAMS::qpDeltaMap have no effect."]
    NV_ENC_QP_MAP_DISABLED = 0,
    #[doc = "< Value in NV_ENC_PIC_PARAMS::qpDeltaMap will be treated as Emphasis level. Currently this is only supported for H264"]
    NV_ENC_QP_MAP_EMPHASIS = 1,
    #[doc = "< Value in NV_ENC_PIC_PARAMS::qpDeltaMap will be treated as QP delta map."]
    NV_ENC_QP_MAP_DELTA = 2,
    #[doc = "< Currently This is not supported. Value in NV_ENC_PIC_PARAMS::qpDeltaMap will be treated as QP value."]
    NV_ENC_QP_MAP = 3,
}
#[doc = " QP MAP MODE"]
pub use self::_NV_ENC_QP_MAP_MODE as NV_ENC_QP_MAP_MODE;
impl _NV_ENC_PIC_STRUCT {
    #[doc = "< Progressive frame"]
    pub const NV_ENC_PIC_STRUCT_FRAME: _NV_ENC_PIC_STRUCT = _NV_ENC_PIC_STRUCT(1);
}
impl _NV_ENC_PIC_STRUCT {
    #[doc = "< Field encoding top field first"]
    pub const NV_ENC_PIC_STRUCT_FIELD_TOP_BOTTOM: _NV_ENC_PIC_STRUCT = _NV_ENC_PIC_STRUCT(2);
}
impl _NV_ENC_PIC_STRUCT {
    #[doc = "< Field encoding bottom field first"]
    pub const NV_ENC_PIC_STRUCT_FIELD_BOTTOM_TOP: _NV_ENC_PIC_STRUCT = _NV_ENC_PIC_STRUCT(3);
}
#[repr(transparent)]
#[doc = " Input picture structure"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_PIC_STRUCT(pub ::std::os::raw::c_uint);
#[doc = " Input picture structure"]
pub use self::_NV_ENC_PIC_STRUCT as NV_ENC_PIC_STRUCT;
#[repr(u32)]
#[doc = " Display picture structure"]
#[doc = " Currently, this enum is only used for deciding the number of clock timestamp sets in Picture Timing SEI / Time Code SEI"]
#[doc = " Otherwise, this has no impact on encoder behavior"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_DISPLAY_PIC_STRUCT {
    #[doc = "< Field encoding top field first"]
    NV_ENC_PIC_STRUCT_DISPLAY_FRAME = 0,
    #[doc = "< Field encoding top field first"]
    NV_ENC_PIC_STRUCT_DISPLAY_FIELD_TOP_BOTTOM = 1,
    #[doc = "< Field encoding bottom field first"]
    NV_ENC_PIC_STRUCT_DISPLAY_FIELD_BOTTOM_TOP = 2,
    #[doc = "< Frame doubling"]
    NV_ENC_PIC_STRUCT_DISPLAY_FRAME_DOUBLING = 3,
    #[doc = "< Field tripling"]
    NV_ENC_PIC_STRUCT_DISPLAY_FRAME_TRIPLING = 4,
}
#[doc = " Display picture structure"]
#[doc = " Currently, this enum is only used for deciding the number of clock timestamp sets in Picture Timing SEI / Time Code SEI"]
#[doc = " Otherwise, this has no impact on encoder behavior"]
pub use self::_NV_ENC_DISPLAY_PIC_STRUCT as NV_ENC_DISPLAY_PIC_STRUCT;
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Forward predicted"]
    pub const NV_ENC_PIC_TYPE_P: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(0);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Bi-directionally predicted picture"]
    pub const NV_ENC_PIC_TYPE_B: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(1);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Intra predicted picture"]
    pub const NV_ENC_PIC_TYPE_I: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(2);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< IDR picture"]
    pub const NV_ENC_PIC_TYPE_IDR: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(3);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Bi-directionally predicted with only Intra MBs"]
    pub const NV_ENC_PIC_TYPE_BI: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(4);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Picture is skipped"]
    pub const NV_ENC_PIC_TYPE_SKIPPED: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(5);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< First picture in intra refresh cycle"]
    pub const NV_ENC_PIC_TYPE_INTRA_REFRESH: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(6);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Non reference P picture"]
    pub const NV_ENC_PIC_TYPE_NONREF_P: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(7);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Switch frame (AV1 only)"]
    pub const NV_ENC_PIC_TYPE_SWITCH: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(8);
}
impl _NV_ENC_PIC_TYPE {
    #[doc = "< Picture type unknown"]
    pub const NV_ENC_PIC_TYPE_UNKNOWN: _NV_ENC_PIC_TYPE = _NV_ENC_PIC_TYPE(255);
}
#[repr(transparent)]
#[doc = " Input picture type"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_PIC_TYPE(pub ::std::os::raw::c_uint);
#[doc = " Input picture type"]
pub use self::_NV_ENC_PIC_TYPE as NV_ENC_PIC_TYPE;
impl _NV_ENC_MV_PRECISION {
    #[doc = "< Driver selects Quarter-Pel motion vector precision by default"]
    pub const NV_ENC_MV_PRECISION_DEFAULT: _NV_ENC_MV_PRECISION = _NV_ENC_MV_PRECISION(0);
}
impl _NV_ENC_MV_PRECISION {
    #[doc = "< Full-Pel motion vector precision"]
    pub const NV_ENC_MV_PRECISION_FULL_PEL: _NV_ENC_MV_PRECISION = _NV_ENC_MV_PRECISION(1);
}
impl _NV_ENC_MV_PRECISION {
    #[doc = "< Half-Pel motion vector precision"]
    pub const NV_ENC_MV_PRECISION_HALF_PEL: _NV_ENC_MV_PRECISION = _NV_ENC_MV_PRECISION(2);
}
impl _NV_ENC_MV_PRECISION {
    #[doc = "< Quarter-Pel motion vector precision"]
    pub const NV_ENC_MV_PRECISION_QUARTER_PEL: _NV_ENC_MV_PRECISION = _NV_ENC_MV_PRECISION(3);
}
#[repr(transparent)]
#[doc = " Motion vector precisions"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_MV_PRECISION(pub ::std::os::raw::c_uint);
#[doc = " Motion vector precisions"]
pub use self::_NV_ENC_MV_PRECISION as NV_ENC_MV_PRECISION;
#[repr(u32)]
#[doc = " Input buffer formats"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_BUFFER_FORMAT {
    #[doc = "< Undefined buffer format"]
    NV_ENC_BUFFER_FORMAT_UNDEFINED = 0,
    #[doc = "< Semi-Planar YUV [Y plane followed by interleaved UV plane]"]
    NV_ENC_BUFFER_FORMAT_NV12 = 1,
    #[doc = "< Planar YUV [Y plane followed by V and U planes]"]
    NV_ENC_BUFFER_FORMAT_YV12 = 16,
    #[doc = "< Planar YUV [Y plane followed by U and V planes]"]
    NV_ENC_BUFFER_FORMAT_IYUV = 256,
    #[doc = "< Planar YUV [Y plane followed by U and V planes]"]
    NV_ENC_BUFFER_FORMAT_YUV444 = 4096,
    #[doc = "< 10 bit Semi-Planar YUV [Y plane followed by interleaved UV plane]. Each pixel of size 2 bytes. Most Significant 10 bits contain pixel data."]
    NV_ENC_BUFFER_FORMAT_YUV420_10BIT = 65536,
    #[doc = "< 10 bit Planar YUV444 [Y plane followed by U and V planes]. Each pixel of size 2 bytes. Most Significant 10 bits contain pixel data."]
    NV_ENC_BUFFER_FORMAT_YUV444_10BIT = 1048576,
    #[doc = "< 8 bit Packed A8R8G8B8. This is a word-ordered format"]
    #[doc = "where a pixel is represented by a 32-bit word with B"]
    #[doc = "in the lowest 8 bits, G in the next 8 bits, R in the"]
    #[doc = "8 bits after that and A in the highest 8 bits."]
    NV_ENC_BUFFER_FORMAT_ARGB = 16777216,
    #[doc = "< 10 bit Packed A2R10G10B10. This is a word-ordered format"]
    #[doc = "where a pixel is represented by a 32-bit word with B"]
    #[doc = "in the lowest 10 bits, G in the next 10 bits, R in the"]
    #[doc = "10 bits after that and A in the highest 2 bits."]
    NV_ENC_BUFFER_FORMAT_ARGB10 = 33554432,
    #[doc = "< 8 bit Packed A8Y8U8V8. This is a word-ordered format"]
    #[doc = "where a pixel is represented by a 32-bit word with V"]
    #[doc = "in the lowest 8 bits, U in the next 8 bits, Y in the"]
    #[doc = "8 bits after that and A in the highest 8 bits."]
    NV_ENC_BUFFER_FORMAT_AYUV = 67108864,
    #[doc = "< 8 bit Packed A8B8G8R8. This is a word-ordered format"]
    #[doc = "where a pixel is represented by a 32-bit word with R"]
    #[doc = "in the lowest 8 bits, G in the next 8 bits, B in the"]
    #[doc = "8 bits after that and A in the highest 8 bits."]
    NV_ENC_BUFFER_FORMAT_ABGR = 268435456,
    #[doc = "< 10 bit Packed A2B10G10R10. This is a word-ordered format"]
    #[doc = "where a pixel is represented by a 32-bit word with R"]
    #[doc = "in the lowest 10 bits, G in the next 10 bits, B in the"]
    #[doc = "10 bits after that and A in the highest 2 bits."]
    NV_ENC_BUFFER_FORMAT_ABGR10 = 536870912,
    #[doc = "< Buffer format representing one-dimensional buffer."]
    #[doc = "This format should be used only when registering the"]
    #[doc = "resource as output buffer, which will be used to write"]
    #[doc = "the encoded bit stream or H.264 ME only mode output."]
    NV_ENC_BUFFER_FORMAT_U8 = 1073741824,
    #[doc = "< Semi-Planar YUV 422 [Y plane followed by interleaved UV plane]"]
    NV_ENC_BUFFER_FORMAT_NV16 = 1073741825,
    #[doc = "< Semi-Planar 10-bit YUV 422 [Y plane followed by interleaved UV plane]"]
    NV_ENC_BUFFER_FORMAT_P210 = 1073741826,
}
#[doc = " Input buffer formats"]
pub use self::_NV_ENC_BUFFER_FORMAT as NV_ENC_BUFFER_FORMAT;
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_HEVC_1: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_3;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_HEVC_2: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_60;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_TIER_HEVC_MAIN: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_AUTOSELECT;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_2: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_AUTOSELECT;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_21: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_TIER_HEVC_HIGH;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_41: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_1b;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_42: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_1;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_43: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_11;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_5: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_12;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_51: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_13;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_7: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_2;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_71: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_21;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_LEVEL_AV1_72: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_H264_22;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_TIER_AV1_0: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_LEVEL_AUTOSELECT;
}
impl _NV_ENC_LEVEL {
    pub const NV_ENC_TIER_AV1_1: _NV_ENC_LEVEL = _NV_ENC_LEVEL::NV_ENC_TIER_HEVC_HIGH;
}
#[repr(u32)]
#[doc = " Encoding levels"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_LEVEL {
    NV_ENC_LEVEL_AUTOSELECT = 0,
    NV_ENC_LEVEL_H264_1 = 10,
    NV_ENC_LEVEL_H264_1b = 9,
    NV_ENC_LEVEL_H264_11 = 11,
    NV_ENC_LEVEL_H264_12 = 12,
    NV_ENC_LEVEL_H264_13 = 13,
    NV_ENC_LEVEL_H264_2 = 20,
    NV_ENC_LEVEL_H264_21 = 21,
    NV_ENC_LEVEL_H264_22 = 22,
    NV_ENC_LEVEL_H264_3 = 30,
    NV_ENC_LEVEL_H264_31 = 31,
    NV_ENC_LEVEL_H264_32 = 32,
    NV_ENC_LEVEL_H264_4 = 40,
    NV_ENC_LEVEL_H264_41 = 41,
    NV_ENC_LEVEL_H264_42 = 42,
    NV_ENC_LEVEL_H264_5 = 50,
    NV_ENC_LEVEL_H264_51 = 51,
    NV_ENC_LEVEL_H264_52 = 52,
    NV_ENC_LEVEL_H264_60 = 60,
    NV_ENC_LEVEL_H264_61 = 61,
    NV_ENC_LEVEL_H264_62 = 62,
    NV_ENC_LEVEL_HEVC_21 = 63,
    NV_ENC_LEVEL_HEVC_3 = 90,
    NV_ENC_LEVEL_HEVC_31 = 93,
    NV_ENC_LEVEL_HEVC_4 = 120,
    NV_ENC_LEVEL_HEVC_41 = 123,
    NV_ENC_LEVEL_HEVC_5 = 150,
    NV_ENC_LEVEL_HEVC_51 = 153,
    NV_ENC_LEVEL_HEVC_52 = 156,
    NV_ENC_LEVEL_HEVC_6 = 180,
    NV_ENC_LEVEL_HEVC_61 = 183,
    NV_ENC_LEVEL_HEVC_62 = 186,
    NV_ENC_TIER_HEVC_HIGH = 1,
    NV_ENC_LEVEL_AV1_22 = 2,
    NV_ENC_LEVEL_AV1_23 = 3,
    NV_ENC_LEVEL_AV1_3 = 4,
    NV_ENC_LEVEL_AV1_31 = 5,
    NV_ENC_LEVEL_AV1_32 = 6,
    NV_ENC_LEVEL_AV1_33 = 7,
    NV_ENC_LEVEL_AV1_4 = 8,
    NV_ENC_LEVEL_AV1_52 = 14,
    NV_ENC_LEVEL_AV1_53 = 15,
    NV_ENC_LEVEL_AV1_6 = 16,
    NV_ENC_LEVEL_AV1_61 = 17,
    NV_ENC_LEVEL_AV1_62 = 18,
    NV_ENC_LEVEL_AV1_63 = 19,
    NV_ENC_LEVEL_AV1_73 = 23,
    NV_ENC_LEVEL_AV1_AUTOSELECT = 24,
}
#[doc = " Encoding levels"]
pub use self::_NV_ENC_LEVEL as NV_ENC_LEVEL;
impl _NVENCSTATUS {
    #[doc = " This indicates that API call returned with no errors."]
    pub const NV_ENC_SUCCESS: _NVENCSTATUS = _NVENCSTATUS(0);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that no encode capable devices were detected."]
    pub const NV_ENC_ERR_NO_ENCODE_DEVICE: _NVENCSTATUS = _NVENCSTATUS(1);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that devices pass by the client is not supported."]
    pub const NV_ENC_ERR_UNSUPPORTED_DEVICE: _NVENCSTATUS = _NVENCSTATUS(2);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the encoder device supplied by the client is not"]
    #[doc = " valid."]
    pub const NV_ENC_ERR_INVALID_ENCODERDEVICE: _NVENCSTATUS = _NVENCSTATUS(3);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that device passed to the API call is invalid."]
    pub const NV_ENC_ERR_INVALID_DEVICE: _NVENCSTATUS = _NVENCSTATUS(4);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that device passed to the API call is no longer available and"]
    #[doc = " needs to be reinitialized. The clients need to destroy the current encoder"]
    #[doc = " session by freeing the allocated input output buffers and destroying the device"]
    #[doc = " and create a new encoding session."]
    pub const NV_ENC_ERR_DEVICE_NOT_EXIST: _NVENCSTATUS = _NVENCSTATUS(5);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that one or more of the pointers passed to the API call"]
    #[doc = " is invalid."]
    pub const NV_ENC_ERR_INVALID_PTR: _NVENCSTATUS = _NVENCSTATUS(6);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that completion event passed in ::NvEncEncodePicture() call"]
    #[doc = " is invalid."]
    pub const NV_ENC_ERR_INVALID_EVENT: _NVENCSTATUS = _NVENCSTATUS(7);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that one or more of the parameter passed to the API call"]
    #[doc = " is invalid."]
    pub const NV_ENC_ERR_INVALID_PARAM: _NVENCSTATUS = _NVENCSTATUS(8);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that an API call was made in wrong sequence/order."]
    pub const NV_ENC_ERR_INVALID_CALL: _NVENCSTATUS = _NVENCSTATUS(9);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the API call failed because it was unable to allocate"]
    #[doc = " enough memory to perform the requested operation."]
    pub const NV_ENC_ERR_OUT_OF_MEMORY: _NVENCSTATUS = _NVENCSTATUS(10);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the encoder has not been initialized with"]
    #[doc = " ::NvEncInitializeEncoder() or that initialization has failed."]
    #[doc = " The client cannot allocate input or output buffers or do any encoding"]
    #[doc = " related operation before successfully initializing the encoder."]
    pub const NV_ENC_ERR_ENCODER_NOT_INITIALIZED: _NVENCSTATUS = _NVENCSTATUS(11);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that an unsupported parameter was passed by the client."]
    pub const NV_ENC_ERR_UNSUPPORTED_PARAM: _NVENCSTATUS = _NVENCSTATUS(12);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the ::NvEncLockBitstream() failed to lock the output"]
    #[doc = " buffer. This happens when the client makes a non blocking lock call to"]
    #[doc = " access the output bitstream by passing NV_ENC_LOCK_BITSTREAM::doNotWait flag."]
    #[doc = " This is not a fatal error and client should retry the same operation after"]
    #[doc = " few milliseconds."]
    pub const NV_ENC_ERR_LOCK_BUSY: _NVENCSTATUS = _NVENCSTATUS(13);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the size of the user buffer passed by the client is"]
    #[doc = " insufficient for the requested operation."]
    pub const NV_ENC_ERR_NOT_ENOUGH_BUFFER: _NVENCSTATUS = _NVENCSTATUS(14);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that an invalid struct version was used by the client."]
    pub const NV_ENC_ERR_INVALID_VERSION: _NVENCSTATUS = _NVENCSTATUS(15);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that ::NvEncMapInputResource() API failed to map the client"]
    #[doc = " provided input resource."]
    pub const NV_ENC_ERR_MAP_FAILED: _NVENCSTATUS = _NVENCSTATUS(16);
}
impl _NVENCSTATUS {
    #[doc = " This indicates encode driver requires more input buffers to produce an output"]
    #[doc = " bitstream. If this error is returned from ::NvEncEncodePicture() API, this"]
    #[doc = " is not a fatal error. If the client is encoding with B frames then,"]
    #[doc = " ::NvEncEncodePicture() API might be buffering the input frame for re-ordering."]
    #[doc = ""]
    #[doc = " A client operating in synchronous mode cannot call ::NvEncLockBitstream()"]
    #[doc = " API on the output bitstream buffer if ::NvEncEncodePicture() returned the"]
    #[doc = " ::NV_ENC_ERR_NEED_MORE_INPUT error code."]
    #[doc = " The client must continue providing input frames until encode driver returns"]
    #[doc = " ::NV_ENC_SUCCESS. After receiving ::NV_ENC_SUCCESS status the client can call"]
    #[doc = " ::NvEncLockBitstream() API on the output buffers in the same order in which"]
    #[doc = " it has called ::NvEncEncodePicture()."]
    pub const NV_ENC_ERR_NEED_MORE_INPUT: _NVENCSTATUS = _NVENCSTATUS(17);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the HW encoder is busy encoding and is unable to encode"]
    #[doc = " the input. The client should call ::NvEncEncodePicture() again after few"]
    #[doc = " milliseconds."]
    pub const NV_ENC_ERR_ENCODER_BUSY: _NVENCSTATUS = _NVENCSTATUS(18);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the completion event passed in ::NvEncEncodePicture()"]
    #[doc = " API has not been registered with encoder driver using ::NvEncRegisterAsyncEvent()."]
    pub const NV_ENC_ERR_EVENT_NOT_REGISTERD: _NVENCSTATUS = _NVENCSTATUS(19);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that an unknown internal error has occurred."]
    pub const NV_ENC_ERR_GENERIC: _NVENCSTATUS = _NVENCSTATUS(20);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the client is attempting to use a feature"]
    #[doc = " that is not available for the license type for the current system."]
    pub const NV_ENC_ERR_INCOMPATIBLE_CLIENT_KEY: _NVENCSTATUS = _NVENCSTATUS(21);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the client is attempting to use a feature"]
    #[doc = " that is not implemented for the current version."]
    pub const NV_ENC_ERR_UNIMPLEMENTED: _NVENCSTATUS = _NVENCSTATUS(22);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the ::NvEncRegisterResource API failed to register the resource."]
    pub const NV_ENC_ERR_RESOURCE_REGISTER_FAILED: _NVENCSTATUS = _NVENCSTATUS(23);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the client is attempting to unregister a resource"]
    #[doc = " that has not been successfully registered."]
    pub const NV_ENC_ERR_RESOURCE_NOT_REGISTERED: _NVENCSTATUS = _NVENCSTATUS(24);
}
impl _NVENCSTATUS {
    #[doc = " This indicates that the client is attempting to unmap a resource"]
    #[doc = " that has not been successfully mapped."]
    pub const NV_ENC_ERR_RESOURCE_NOT_MAPPED: _NVENCSTATUS = _NVENCSTATUS(25);
}
impl _NVENCSTATUS {
    #[doc = " This indicates encode driver requires more output buffers to write an output"]
    #[doc = " bitstream. If this error is returned from ::NvEncRestoreEncoderState() API, this"]
    #[doc = " is not a fatal error. If the client is encoding with B frames then,"]
    #[doc = " ::NvEncRestoreEncoderState() API might be requiring the extra output buffer for accomodating overlay frame output in a separate buffer, for AV1 codec."]
    #[doc = " In this case, client must call NvEncRestoreEncoderState() API again with NV_ENC_RESTORE_ENCODER_STATE_PARAMS::outputBitstream as input along with"]
    #[doc = " the parameters in the previous call. When operating in asynchronous mode of encoding, client must also specify NV_ENC_RESTORE_ENCODER_STATE_PARAMS::completionEvent."]
    pub const NV_ENC_ERR_NEED_MORE_OUTPUT: _NVENCSTATUS = _NVENCSTATUS(26);
}
#[repr(transparent)]
#[doc = " Error Codes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NVENCSTATUS(pub ::std::os::raw::c_uint);
#[doc = " Error Codes"]
pub use self::_NVENCSTATUS as NVENCSTATUS;
#[repr(u32)]
#[doc = " Encode Picture encode flags."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_PIC_FLAGS {
    #[doc = "< Encode the current picture as an Intra picture"]
    NV_ENC_PIC_FLAG_FORCEINTRA = 1,
    #[doc = "< Encode the current picture as an IDR picture."]
    #[doc = "This flag is only valid when Picture type decision is taken by the Encoder"]
    #[doc = "[_NV_ENC_INITIALIZE_PARAMS::enablePTD == 1]."]
    NV_ENC_PIC_FLAG_FORCEIDR = 2,
    #[doc = "< Write the sequence and picture header in encoded bitstream of the current picture"]
    NV_ENC_PIC_FLAG_OUTPUT_SPSPPS = 4,
    #[doc = "< Indicates end of the input stream"]
    NV_ENC_PIC_FLAG_EOS = 8,
    #[doc = "< Do not advance encoder state during encode"]
    NV_ENC_PIC_FLAG_DISABLE_ENC_STATE_ADVANCE = 16,
    #[doc = "< Write reconstructed frame"]
    NV_ENC_PIC_FLAG_OUTPUT_RECON_FRAME = 32,
}
#[doc = " Encode Picture encode flags."]
pub use self::_NV_ENC_PIC_FLAGS as NV_ENC_PIC_FLAGS;
#[repr(u32)]
#[doc = " Memory heap to allocate input and output buffers."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_MEMORY_HEAP {
    #[doc = "< Memory heap to be decided by the encoder driver based on the usage"]
    NV_ENC_MEMORY_HEAP_AUTOSELECT = 0,
    #[doc = "< Memory heap is in local video memory"]
    NV_ENC_MEMORY_HEAP_VID = 1,
    #[doc = "< Memory heap is in cached system memory"]
    NV_ENC_MEMORY_HEAP_SYSMEM_CACHED = 2,
    #[doc = "< Memory heap is in uncached system memory"]
    NV_ENC_MEMORY_HEAP_SYSMEM_UNCACHED = 3,
}
#[doc = " Memory heap to allocate input and output buffers."]
pub use self::_NV_ENC_MEMORY_HEAP as NV_ENC_MEMORY_HEAP;
#[repr(u32)]
#[doc = " B-frame used as reference modes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_BFRAME_REF_MODE {
    #[doc = "< B frame is not used for reference"]
    NV_ENC_BFRAME_REF_MODE_DISABLED = 0,
    #[doc = "< Each B-frame will be used for reference"]
    NV_ENC_BFRAME_REF_MODE_EACH = 1,
    #[doc = "< Only(Number of B-frame)/2 th B-frame will be used for reference"]
    NV_ENC_BFRAME_REF_MODE_MIDDLE = 2,
}
#[doc = " B-frame used as reference modes"]
pub use self::_NV_ENC_BFRAME_REF_MODE as NV_ENC_BFRAME_REF_MODE;
#[repr(u32)]
#[doc = " H.264 entropy coding modes."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_H264_ENTROPY_CODING_MODE {
    #[doc = "< Entropy coding mode is auto selected by the encoder driver"]
    NV_ENC_H264_ENTROPY_CODING_MODE_AUTOSELECT = 0,
    #[doc = "< Entropy coding mode is CABAC"]
    NV_ENC_H264_ENTROPY_CODING_MODE_CABAC = 1,
    #[doc = "< Entropy coding mode is CAVLC"]
    NV_ENC_H264_ENTROPY_CODING_MODE_CAVLC = 2,
}
#[doc = " H.264 entropy coding modes."]
pub use self::_NV_ENC_H264_ENTROPY_CODING_MODE as NV_ENC_H264_ENTROPY_CODING_MODE;
#[repr(u32)]
#[doc = " H.264 specific BDirect modes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_H264_BDIRECT_MODE {
    #[doc = "< BDirect mode is auto selected by the encoder driver"]
    NV_ENC_H264_BDIRECT_MODE_AUTOSELECT = 0,
    #[doc = "< Disable BDirect mode"]
    NV_ENC_H264_BDIRECT_MODE_DISABLE = 1,
    #[doc = "< Temporal BDirect mode"]
    NV_ENC_H264_BDIRECT_MODE_TEMPORAL = 2,
    #[doc = "< Spatial BDirect mode"]
    NV_ENC_H264_BDIRECT_MODE_SPATIAL = 3,
}
#[doc = " H.264 specific BDirect modes"]
pub use self::_NV_ENC_H264_BDIRECT_MODE as NV_ENC_H264_BDIRECT_MODE;
#[repr(u32)]
#[doc = " H.264 specific FMO usage"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_H264_FMO_MODE {
    #[doc = "< FMO usage is auto selected by the encoder driver"]
    NV_ENC_H264_FMO_AUTOSELECT = 0,
    #[doc = "< Enable FMO"]
    NV_ENC_H264_FMO_ENABLE = 1,
    #[doc = "< Disable FMO"]
    NV_ENC_H264_FMO_DISABLE = 2,
}
#[doc = " H.264 specific FMO usage"]
pub use self::_NV_ENC_H264_FMO_MODE as NV_ENC_H264_FMO_MODE;
#[repr(u32)]
#[doc = " H.264 specific Adaptive Transform modes"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_H264_ADAPTIVE_TRANSFORM_MODE {
    #[doc = "< Adaptive Transform 8x8 mode is auto selected by the encoder driver"]
    NV_ENC_H264_ADAPTIVE_TRANSFORM_AUTOSELECT = 0,
    #[doc = "< Adaptive Transform 8x8 mode disabled"]
    NV_ENC_H264_ADAPTIVE_TRANSFORM_DISABLE = 1,
    #[doc = "< Adaptive Transform 8x8 mode should be used"]
    NV_ENC_H264_ADAPTIVE_TRANSFORM_ENABLE = 2,
}
#[doc = " H.264 specific Adaptive Transform modes"]
pub use self::_NV_ENC_H264_ADAPTIVE_TRANSFORM_MODE as NV_ENC_H264_ADAPTIVE_TRANSFORM_MODE;
#[repr(u32)]
#[doc = " Stereo frame packing modes."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_STEREO_PACKING_MODE {
    #[doc = "< No Stereo packing required"]
    NV_ENC_STEREO_PACKING_MODE_NONE = 0,
    #[doc = "< Checkerboard mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_CHECKERBOARD = 1,
    #[doc = "< Column Interleave mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_COLINTERLEAVE = 2,
    #[doc = "< Row Interleave mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_ROWINTERLEAVE = 3,
    #[doc = "< Side-by-side mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_SIDEBYSIDE = 4,
    #[doc = "< Top-Bottom mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_TOPBOTTOM = 5,
    #[doc = "< Frame Sequential mode for packing stereo frames"]
    NV_ENC_STEREO_PACKING_MODE_FRAMESEQ = 6,
}
#[doc = " Stereo frame packing modes."]
pub use self::_NV_ENC_STEREO_PACKING_MODE as NV_ENC_STEREO_PACKING_MODE;
#[repr(u32)]
#[doc = "  Input Resource type"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_INPUT_RESOURCE_TYPE {
    #[doc = "< input resource type is a directx9 surface"]
    NV_ENC_INPUT_RESOURCE_TYPE_DIRECTX = 0,
    #[doc = "< input resource type is a cuda device pointer surface"]
    NV_ENC_INPUT_RESOURCE_TYPE_CUDADEVICEPTR = 1,
    #[doc = "< input resource type is a cuda array surface."]
    #[doc = "This array must be a 2D array and the CUDA_ARRAY3D_SURFACE_LDST"]
    #[doc = "flag must have been specified when creating it."]
    NV_ENC_INPUT_RESOURCE_TYPE_CUDAARRAY = 2,
    #[doc = "< input resource type is an OpenGL texture"]
    NV_ENC_INPUT_RESOURCE_TYPE_OPENGL_TEX = 3,
}
#[doc = "  Input Resource type"]
pub use self::_NV_ENC_INPUT_RESOURCE_TYPE as NV_ENC_INPUT_RESOURCE_TYPE;
#[repr(u32)]
#[doc = "  Buffer usage"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_BUFFER_USAGE {
    #[doc = "< Registered surface will be used for input image"]
    NV_ENC_INPUT_IMAGE = 0,
    #[doc = "< Registered surface will be used for output of H.264 ME only mode."]
    #[doc = "This buffer usage type is not supported for HEVC ME only mode."]
    NV_ENC_OUTPUT_MOTION_VECTOR = 1,
    #[doc = "< Registered surface will be used for output bitstream in encoding"]
    NV_ENC_OUTPUT_BITSTREAM = 2,
    #[doc = "< Registered surface will be used for output reconstructed frame in encoding"]
    NV_ENC_OUTPUT_RECON = 4,
}
#[doc = "  Buffer usage"]
pub use self::_NV_ENC_BUFFER_USAGE as NV_ENC_BUFFER_USAGE;
#[repr(u32)]
#[doc = "  Encoder Device type"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_DEVICE_TYPE {
    #[doc = "< encode device type is a directx9 device"]
    NV_ENC_DEVICE_TYPE_DIRECTX = 0,
    #[doc = "< encode device type is a cuda device"]
    NV_ENC_DEVICE_TYPE_CUDA = 1,
    #[doc = "< encode device type is an OpenGL device."]
    #[doc = "Use of this device type is supported only on Linux"]
    NV_ENC_DEVICE_TYPE_OPENGL = 2,
}
#[doc = "  Encoder Device type"]
pub use self::_NV_ENC_DEVICE_TYPE as NV_ENC_DEVICE_TYPE;
#[repr(u32)]
#[doc = " Number of reference frames"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_NUM_REF_FRAMES {
    #[doc = "< Number of reference frames is auto selected by the encoder driver"]
    NV_ENC_NUM_REF_FRAMES_AUTOSELECT = 0,
    #[doc = "< Number of reference frames equal to 1"]
    NV_ENC_NUM_REF_FRAMES_1 = 1,
    #[doc = "< Number of reference frames equal to 2"]
    NV_ENC_NUM_REF_FRAMES_2 = 2,
    #[doc = "< Number of reference frames equal to 3"]
    NV_ENC_NUM_REF_FRAMES_3 = 3,
    #[doc = "< Number of reference frames equal to 4"]
    NV_ENC_NUM_REF_FRAMES_4 = 4,
    #[doc = "< Number of reference frames equal to 5"]
    NV_ENC_NUM_REF_FRAMES_5 = 5,
    #[doc = "< Number of reference frames equal to 6"]
    NV_ENC_NUM_REF_FRAMES_6 = 6,
    #[doc = "< Number of reference frames equal to 7"]
    NV_ENC_NUM_REF_FRAMES_7 = 7,
}
#[doc = " Number of reference frames"]
pub use self::_NV_ENC_NUM_REF_FRAMES as NV_ENC_NUM_REF_FRAMES;
#[repr(u32)]
#[doc = "  Enum for Temporal filtering level."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_TEMPORAL_FILTER_LEVEL {
    NV_ENC_TEMPORAL_FILTER_LEVEL_0 = 0,
    NV_ENC_TEMPORAL_FILTER_LEVEL_4 = 4,
}
#[doc = "  Enum for Temporal filtering level."]
pub use self::_NV_ENC_TEMPORAL_FILTER_LEVEL as NV_ENC_TEMPORAL_FILTER_LEVEL;
#[repr(u32)]
#[doc = " Encoder capabilities enumeration."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_CAPS {
    #[doc = " Maximum number of B-Frames supported."]
    NV_ENC_CAPS_NUM_MAX_BFRAMES = 0,
    #[doc = " Rate control modes supported."]
    #[doc = " \\n The API return value is a bitmask of the values in NV_ENC_PARAMS_RC_MODE."]
    NV_ENC_CAPS_SUPPORTED_RATECONTROL_MODES = 1,
    #[doc = " Indicates HW support for field mode encoding."]
    #[doc = " \\n 0 : Interlaced mode encoding is not supported."]
    #[doc = " \\n 1 : Interlaced field mode encoding is supported."]
    #[doc = " \\n 2 : Interlaced frame encoding and field mode encoding are both supported."]
    NV_ENC_CAPS_SUPPORT_FIELD_ENCODING = 2,
    #[doc = " Indicates HW support for monochrome mode encoding."]
    #[doc = " \\n 0 : Monochrome mode not supported."]
    #[doc = " \\n 1 : Monochrome mode supported."]
    NV_ENC_CAPS_SUPPORT_MONOCHROME = 3,
    #[doc = " Indicates HW support for FMO."]
    #[doc = " \\n 0 : FMO not supported."]
    #[doc = " \\n 1 : FMO supported."]
    NV_ENC_CAPS_SUPPORT_FMO = 4,
    #[doc = " Indicates HW capability for Quarter pel motion estimation."]
    #[doc = " \\n 0 : Quarter-Pel Motion Estimation not supported."]
    #[doc = " \\n 1 : Quarter-Pel Motion Estimation supported."]
    NV_ENC_CAPS_SUPPORT_QPELMV = 5,
    #[doc = " H.264 specific. Indicates HW support for BDirect modes."]
    #[doc = " \\n 0 : BDirect mode encoding not supported."]
    #[doc = " \\n 1 : BDirect mode encoding supported."]
    NV_ENC_CAPS_SUPPORT_BDIRECT_MODE = 6,
    #[doc = " H264 specific. Indicates HW support for CABAC entropy coding mode."]
    #[doc = " \\n 0 : CABAC entropy coding not supported."]
    #[doc = " \\n 1 : CABAC entropy coding supported."]
    NV_ENC_CAPS_SUPPORT_CABAC = 7,
    #[doc = " Indicates HW support for Adaptive Transform."]
    #[doc = " \\n 0 : Adaptive Transform not supported."]
    #[doc = " \\n 1 : Adaptive Transform supported."]
    NV_ENC_CAPS_SUPPORT_ADAPTIVE_TRANSFORM = 8,
    #[doc = " Indicates HW support for Multi View Coding."]
    #[doc = " \\n 0 : Multi View Coding not supported."]
    #[doc = " \\n 1 : Multi View Coding supported."]
    NV_ENC_CAPS_SUPPORT_STEREO_MVC = 9,
    #[doc = " Indicates HW support for encoding Temporal layers."]
    #[doc = " \\n 0 : Encoding Temporal layers not supported."]
    #[doc = " \\n 1 : Encoding Temporal layers supported."]
    NV_ENC_CAPS_NUM_MAX_TEMPORAL_LAYERS = 10,
    #[doc = " Indicates HW support for Hierarchical P frames."]
    #[doc = " \\n 0 : Hierarchical P frames not supported."]
    #[doc = " \\n 1 : Hierarchical P frames supported."]
    NV_ENC_CAPS_SUPPORT_HIERARCHICAL_PFRAMES = 11,
    #[doc = " Indicates HW support for Hierarchical B frames."]
    #[doc = " \\n 0 : Hierarchical B frames not supported."]
    #[doc = " \\n 1 : Hierarchical B frames supported."]
    NV_ENC_CAPS_SUPPORT_HIERARCHICAL_BFRAMES = 12,
    #[doc = " Maximum Encoding level supported (See ::NV_ENC_LEVEL for details)."]
    NV_ENC_CAPS_LEVEL_MAX = 13,
    #[doc = " Minimum Encoding level supported (See ::NV_ENC_LEVEL for details)."]
    NV_ENC_CAPS_LEVEL_MIN = 14,
    #[doc = " Indicates HW support for separate colour plane encoding."]
    #[doc = " \\n 0 : Separate colour plane encoding not supported."]
    #[doc = " \\n 1 : Separate colour plane encoding supported."]
    NV_ENC_CAPS_SEPARATE_COLOUR_PLANE = 15,
    #[doc = " Maximum output width supported."]
    NV_ENC_CAPS_WIDTH_MAX = 16,
    #[doc = " Maximum output height supported."]
    NV_ENC_CAPS_HEIGHT_MAX = 17,
    #[doc = " Indicates Temporal Scalability Support."]
    #[doc = " \\n 0 : Temporal SVC encoding not supported."]
    #[doc = " \\n 1 : Temporal SVC encoding supported."]
    NV_ENC_CAPS_SUPPORT_TEMPORAL_SVC = 18,
    #[doc = " Indicates Dynamic Encode Resolution Change Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Dynamic Encode Resolution Change not supported."]
    #[doc = " \\n 1 : Dynamic Encode Resolution Change supported."]
    NV_ENC_CAPS_SUPPORT_DYN_RES_CHANGE = 19,
    #[doc = " Indicates Dynamic Encode Bitrate Change Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Dynamic Encode bitrate change not supported."]
    #[doc = " \\n 1 : Dynamic Encode bitrate change supported."]
    NV_ENC_CAPS_SUPPORT_DYN_BITRATE_CHANGE = 20,
    #[doc = " Indicates Forcing Constant QP On The Fly Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Forcing constant QP on the fly not supported."]
    #[doc = " \\n 1 : Forcing constant QP on the fly supported."]
    NV_ENC_CAPS_SUPPORT_DYN_FORCE_CONSTQP = 21,
    #[doc = " Indicates Dynamic rate control mode Change Support."]
    #[doc = " \\n 0 : Dynamic rate control mode change not supported."]
    #[doc = " \\n 1 : Dynamic rate control mode change supported."]
    NV_ENC_CAPS_SUPPORT_DYN_RCMODE_CHANGE = 22,
    #[doc = " Indicates Subframe readback support for slice-based encoding. If this feature is supported, it can be enabled by setting enableSubFrameWrite = 1."]
    #[doc = " \\n 0 : Subframe readback not supported."]
    #[doc = " \\n 1 : Subframe readback supported."]
    NV_ENC_CAPS_SUPPORT_SUBFRAME_READBACK = 23,
    #[doc = " Indicates Constrained Encoding mode support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Constrained encoding mode not supported."]
    #[doc = " \\n 1 : Constrained encoding mode supported."]
    #[doc = " If this mode is supported client can enable this during initialization."]
    #[doc = " Client can then force a picture to be coded as constrained picture where"]
    #[doc = " in-loop filtering is disabled across slice boundaries and prediction vectors for inter"]
    #[doc = " macroblocks in each slice will be restricted to the slice region."]
    NV_ENC_CAPS_SUPPORT_CONSTRAINED_ENCODING = 24,
    #[doc = " Indicates Intra Refresh Mode Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Intra Refresh Mode not supported."]
    #[doc = " \\n 1 : Intra Refresh Mode supported."]
    NV_ENC_CAPS_SUPPORT_INTRA_REFRESH = 25,
    #[doc = " Indicates Custom VBV Buffer Size support. It can be used for capping frame size."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Custom VBV buffer size specification from client, not supported."]
    #[doc = " \\n 1 : Custom VBV buffer size specification from client, supported."]
    NV_ENC_CAPS_SUPPORT_CUSTOM_VBV_BUF_SIZE = 26,
    #[doc = " Indicates Dynamic Slice Mode Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Dynamic Slice Mode not supported."]
    #[doc = " \\n 1 : Dynamic Slice Mode supported."]
    NV_ENC_CAPS_SUPPORT_DYNAMIC_SLICE_MODE = 27,
    #[doc = " Indicates Reference Picture Invalidation Support."]
    #[doc = " Support added from NvEncodeAPI version 2.0."]
    #[doc = " \\n 0 : Reference Picture Invalidation not supported."]
    #[doc = " \\n 1 : Reference Picture Invalidation supported."]
    NV_ENC_CAPS_SUPPORT_REF_PIC_INVALIDATION = 28,
    #[doc = " Indicates support for Pre-Processing."]
    #[doc = " The API return value is a bitmask of the values defined in ::NV_ENC_PREPROC_FLAGS"]
    NV_ENC_CAPS_PREPROC_SUPPORT = 29,
    #[doc = " Indicates support Async mode."]
    #[doc = " \\n 0 : Async Encode mode not supported."]
    #[doc = " \\n 1 : Async Encode mode supported."]
    NV_ENC_CAPS_ASYNC_ENCODE_SUPPORT = 30,
    #[doc = " Maximum MBs per frame supported."]
    NV_ENC_CAPS_MB_NUM_MAX = 31,
    #[doc = " Maximum aggregate throughput in MBs per sec."]
    NV_ENC_CAPS_MB_PER_SEC_MAX = 32,
    #[doc = " Indicates HW support for YUV444 mode encoding."]
    #[doc = " \\n 0 : YUV444 mode encoding not supported."]
    #[doc = " \\n 1 : YUV444 mode encoding supported."]
    NV_ENC_CAPS_SUPPORT_YUV444_ENCODE = 33,
    #[doc = " Indicates HW support for lossless encoding."]
    #[doc = " \\n 0 : lossless encoding not supported."]
    #[doc = " \\n 1 : lossless encoding supported."]
    NV_ENC_CAPS_SUPPORT_LOSSLESS_ENCODE = 34,
    #[doc = " Indicates HW support for Sample Adaptive Offset."]
    #[doc = " \\n 0 : SAO not supported."]
    #[doc = " \\n 1 : SAO encoding supported."]
    NV_ENC_CAPS_SUPPORT_SAO = 35,
    #[doc = " Indicates HW support for Motion Estimation Only Mode."]
    #[doc = " \\n 0 : MEOnly Mode not supported."]
    #[doc = " \\n 1 : MEOnly Mode supported for I and P frames."]
    #[doc = " \\n 2 : MEOnly Mode supported for I, P and B frames."]
    NV_ENC_CAPS_SUPPORT_MEONLY_MODE = 36,
    #[doc = " Indicates HW support for lookahead encoding (enableLookahead=1)."]
    #[doc = " \\n 0 : Lookahead not supported."]
    #[doc = " \\n 1 : Lookahead supported."]
    NV_ENC_CAPS_SUPPORT_LOOKAHEAD = 37,
    #[doc = " Indicates HW support for temporal AQ encoding (enableTemporalAQ=1)."]
    #[doc = " \\n 0 : Temporal AQ not supported."]
    #[doc = " \\n 1 : Temporal AQ supported."]
    NV_ENC_CAPS_SUPPORT_TEMPORAL_AQ = 38,
    #[doc = " Indicates HW support for 10 bit encoding."]
    #[doc = " \\n 0 : 10 bit encoding not supported."]
    #[doc = " \\n 1 : 10 bit encoding supported."]
    NV_ENC_CAPS_SUPPORT_10BIT_ENCODE = 39,
    #[doc = " Maximum number of Long Term Reference frames supported"]
    NV_ENC_CAPS_NUM_MAX_LTR_FRAMES = 40,
    #[doc = " Indicates HW support for Weighted Prediction."]
    #[doc = " \\n 0 : Weighted Prediction not supported."]
    #[doc = " \\n 1 : Weighted Prediction supported."]
    NV_ENC_CAPS_SUPPORT_WEIGHTED_PREDICTION = 41,
    #[doc = " On managed (vGPU) platforms (Windows only), this API, in conjunction with other GRID Management APIs, can be used"]
    #[doc = " to estimate the residual capacity of the hardware encoder on the GPU as a percentage of the total available encoder capacity."]
    #[doc = " This API can be called at any time; i.e. during the encode session or before opening the encode session."]
    #[doc = " If the available encoder capacity is returned as zero, applications may choose to switch to software encoding"]
    #[doc = " and continue to call this API (e.g. polling once per second) until capacity becomes available."]
    #[doc = ""]
    #[doc = " On bare metal (non-virtualized GPU) and linux platforms, this API always returns 100."]
    NV_ENC_CAPS_DYNAMIC_QUERY_ENCODER_CAPACITY = 42,
    #[doc = " Indicates B as reference support."]
    #[doc = " \\n 0 : B as reference is not supported."]
    #[doc = " \\n 1 : each B-Frame as reference is supported."]
    #[doc = " \\n 2 : only Middle B-frame as reference is supported."]
    NV_ENC_CAPS_SUPPORT_BFRAME_REF_MODE = 43,
    #[doc = " Indicates HW support for Emphasis Level Map based delta QP computation."]
    #[doc = " \\n 0 : Emphasis Level Map based delta QP not supported."]
    #[doc = " \\n 1 : Emphasis Level Map based delta QP is supported."]
    NV_ENC_CAPS_SUPPORT_EMPHASIS_LEVEL_MAP = 44,
    #[doc = " Minimum input width supported."]
    NV_ENC_CAPS_WIDTH_MIN = 45,
    #[doc = " Minimum input height supported."]
    NV_ENC_CAPS_HEIGHT_MIN = 46,
    #[doc = " Indicates HW support for multiple reference frames."]
    NV_ENC_CAPS_SUPPORT_MULTIPLE_REF_FRAMES = 47,
    #[doc = " Indicates HW support for HEVC with alpha encoding."]
    #[doc = " \\n 0 : HEVC with alpha encoding not supported."]
    #[doc = " \\n 1 : HEVC with alpha encoding is supported."]
    NV_ENC_CAPS_SUPPORT_ALPHA_LAYER_ENCODING = 48,
    #[doc = " Indicates number of Encoding engines present on GPU."]
    NV_ENC_CAPS_NUM_ENCODER_ENGINES = 49,
    #[doc = " Indicates single slice intra refresh support."]
    NV_ENC_CAPS_SINGLE_SLICE_INTRA_REFRESH = 50,
    #[doc = " Indicates encoding without advancing the state support."]
    NV_ENC_CAPS_DISABLE_ENC_STATE_ADVANCE = 51,
    #[doc = " Indicates reconstructed output support."]
    NV_ENC_CAPS_OUTPUT_RECON_SURFACE = 52,
    #[doc = " Indicates encoded frame output stats support for every block. Block represents a CTB for HEVC, macroblock for H.264 and super block for AV1."]
    NV_ENC_CAPS_OUTPUT_BLOCK_STATS = 53,
    #[doc = " Indicates encoded frame output stats support for every row. Row represents a CTB row for HEVC, macroblock row for H.264 and super block row for AV1."]
    NV_ENC_CAPS_OUTPUT_ROW_STATS = 54,
    #[doc = " Indicates temporal filtering support."]
    NV_ENC_CAPS_SUPPORT_TEMPORAL_FILTER = 55,
    #[doc = " Maximum Lookahead level supported (See ::NV_ENC_LOOKAHEAD_LEVEL for details)."]
    NV_ENC_CAPS_SUPPORT_LOOKAHEAD_LEVEL = 56,
    #[doc = " Indicates UnidirectionalB support."]
    NV_ENC_CAPS_SUPPORT_UNIDIRECTIONAL_B = 57,
    #[doc = " Indicates HW support for MVHEVC encoding."]
    #[doc = " \\n 0 : MVHEVC encoding not supported."]
    #[doc = " \\n 1 : MVHEVC encoding supported."]
    NV_ENC_CAPS_SUPPORT_MVHEVC_ENCODE = 58,
    #[doc = " Indicates HW support for YUV422 mode encoding."]
    #[doc = " \\n 0 : YUV422 mode encoding not supported."]
    #[doc = " \\n 1 : YUV422 mode encoding supported."]
    NV_ENC_CAPS_SUPPORT_YUV422_ENCODE = 59,
    #[doc = " Reserved - Not to be used by clients."]
    NV_ENC_CAPS_EXPOSED_COUNT = 60,
}
#[doc = " Encoder capabilities enumeration."]
pub use self::_NV_ENC_CAPS as NV_ENC_CAPS;
#[repr(u32)]
#[doc = "  HEVC CU SIZE"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_HEVC_CUSIZE {
    NV_ENC_HEVC_CUSIZE_AUTOSELECT = 0,
    NV_ENC_HEVC_CUSIZE_8x8 = 1,
    NV_ENC_HEVC_CUSIZE_16x16 = 2,
    NV_ENC_HEVC_CUSIZE_32x32 = 3,
    NV_ENC_HEVC_CUSIZE_64x64 = 4,
}
#[doc = "  HEVC CU SIZE"]
pub use self::_NV_ENC_HEVC_CUSIZE as NV_ENC_HEVC_CUSIZE;
#[repr(u32)]
#[doc = "  AV1 PART SIZE"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_AV1_PART_SIZE {
    NV_ENC_AV1_PART_SIZE_AUTOSELECT = 0,
    NV_ENC_AV1_PART_SIZE_4x4 = 1,
    NV_ENC_AV1_PART_SIZE_8x8 = 2,
    NV_ENC_AV1_PART_SIZE_16x16 = 3,
    NV_ENC_AV1_PART_SIZE_32x32 = 4,
    NV_ENC_AV1_PART_SIZE_64x64 = 5,
}
#[doc = "  AV1 PART SIZE"]
pub use self::_NV_ENC_AV1_PART_SIZE as NV_ENC_AV1_PART_SIZE;
#[repr(u32)]
#[doc = "  Enums related to fields in VUI parameters."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_VUI_VIDEO_FORMAT {
    NV_ENC_VUI_VIDEO_FORMAT_COMPONENT = 0,
    NV_ENC_VUI_VIDEO_FORMAT_PAL = 1,
    NV_ENC_VUI_VIDEO_FORMAT_NTSC = 2,
    NV_ENC_VUI_VIDEO_FORMAT_SECAM = 3,
    NV_ENC_VUI_VIDEO_FORMAT_MAC = 4,
    NV_ENC_VUI_VIDEO_FORMAT_UNSPECIFIED = 5,
}
#[doc = "  Enums related to fields in VUI parameters."]
pub use self::_NV_ENC_VUI_VIDEO_FORMAT as NV_ENC_VUI_VIDEO_FORMAT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_VUI_COLOR_PRIMARIES {
    NV_ENC_VUI_COLOR_PRIMARIES_UNDEFINED = 0,
    NV_ENC_VUI_COLOR_PRIMARIES_BT709 = 1,
    NV_ENC_VUI_COLOR_PRIMARIES_UNSPECIFIED = 2,
    NV_ENC_VUI_COLOR_PRIMARIES_RESERVED = 3,
    NV_ENC_VUI_COLOR_PRIMARIES_BT470M = 4,
    NV_ENC_VUI_COLOR_PRIMARIES_BT470BG = 5,
    NV_ENC_VUI_COLOR_PRIMARIES_SMPTE170M = 6,
    NV_ENC_VUI_COLOR_PRIMARIES_SMPTE240M = 7,
    NV_ENC_VUI_COLOR_PRIMARIES_FILM = 8,
    NV_ENC_VUI_COLOR_PRIMARIES_BT2020 = 9,
    NV_ENC_VUI_COLOR_PRIMARIES_SMPTE428 = 10,
    NV_ENC_VUI_COLOR_PRIMARIES_SMPTE431 = 11,
    NV_ENC_VUI_COLOR_PRIMARIES_SMPTE432 = 12,
    NV_ENC_VUI_COLOR_PRIMARIES_JEDEC_P22 = 22,
}
pub use self::_NV_ENC_VUI_COLOR_PRIMARIES as NV_ENC_VUI_COLOR_PRIMARIES;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_VUI_TRANSFER_CHARACTERISTIC {
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_UNDEFINED = 0,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT709 = 1,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_UNSPECIFIED = 2,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_RESERVED = 3,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT470M = 4,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT470BG = 5,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_SMPTE170M = 6,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_SMPTE240M = 7,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_LINEAR = 8,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_LOG = 9,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_LOG_SQRT = 10,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_IEC61966_2_4 = 11,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT1361_ECG = 12,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_SRGB = 13,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT2020_10 = 14,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_BT2020_12 = 15,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_SMPTE2084 = 16,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_SMPTE428 = 17,
    NV_ENC_VUI_TRANSFER_CHARACTERISTIC_ARIB_STD_B67 = 18,
}
pub use self::_NV_ENC_VUI_TRANSFER_CHARACTERISTIC as NV_ENC_VUI_TRANSFER_CHARACTERISTIC;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_VUI_MATRIX_COEFFS {
    NV_ENC_VUI_MATRIX_COEFFS_RGB = 0,
    NV_ENC_VUI_MATRIX_COEFFS_BT709 = 1,
    NV_ENC_VUI_MATRIX_COEFFS_UNSPECIFIED = 2,
    NV_ENC_VUI_MATRIX_COEFFS_RESERVED = 3,
    NV_ENC_VUI_MATRIX_COEFFS_FCC = 4,
    NV_ENC_VUI_MATRIX_COEFFS_BT470BG = 5,
    NV_ENC_VUI_MATRIX_COEFFS_SMPTE170M = 6,
    NV_ENC_VUI_MATRIX_COEFFS_SMPTE240M = 7,
    NV_ENC_VUI_MATRIX_COEFFS_YCGCO = 8,
    NV_ENC_VUI_MATRIX_COEFFS_BT2020_NCL = 9,
    NV_ENC_VUI_MATRIX_COEFFS_BT2020_CL = 10,
    NV_ENC_VUI_MATRIX_COEFFS_SMPTE2085 = 11,
}
pub use self::_NV_ENC_VUI_MATRIX_COEFFS as NV_ENC_VUI_MATRIX_COEFFS;
#[repr(u32)]
#[doc = "  Enum for Lookahead level."]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_LOOKAHEAD_LEVEL {
    NV_ENC_LOOKAHEAD_LEVEL_0 = 0,
    NV_ENC_LOOKAHEAD_LEVEL_1 = 1,
    NV_ENC_LOOKAHEAD_LEVEL_2 = 2,
    NV_ENC_LOOKAHEAD_LEVEL_3 = 3,
    NV_ENC_LOOKAHEAD_LEVEL_AUTOSELECT = 15,
}
#[doc = "  Enum for Lookahead level."]
pub use self::_NV_ENC_LOOKAHEAD_LEVEL as NV_ENC_LOOKAHEAD_LEVEL;
#[repr(u32)]
#[doc = " Enum for Bit Depth"]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub enum _NV_ENC_BIT_DEPTH {
    #[doc = "< Invalid Bit Depth"]
    NV_ENC_BIT_DEPTH_INVALID = 0,
    #[doc = "< Bit Depth 8"]
    NV_ENC_BIT_DEPTH_8 = 8,
    #[doc = "< Bit Depth 10"]
    NV_ENC_BIT_DEPTH_10 = 10,
}
#[doc = " Enum for Bit Depth"]
pub use self::_NV_ENC_BIT_DEPTH as NV_ENC_BIT_DEPTH;
#[doc = " Input struct for querying Encoding capabilities."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CAPS_PARAM {
    #[doc = "< [in]: Struct version. Must be set to ::NV_ENC_CAPS_PARAM_VER"]
    pub version: u32,
    #[doc = "< [in]: Specifies the encode capability to be queried. Client should pass a member for ::NV_ENC_CAPS enum."]
    pub capsToQuery: NV_ENC_CAPS,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u32; 62usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CAPS_PARAM() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CAPS_PARAM>(),
        256usize,
        concat!("Size of: ", stringify!(_NV_ENC_CAPS_PARAM))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CAPS_PARAM>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CAPS_PARAM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CAPS_PARAM>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CAPS_PARAM),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CAPS_PARAM>())).capsToQuery as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CAPS_PARAM),
            "::",
            stringify!(capsToQuery)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CAPS_PARAM>())).reserved as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CAPS_PARAM),
            "::",
            stringify!(reserved)
        )
    );
}
impl Default for _NV_ENC_CAPS_PARAM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Input struct for querying Encoding capabilities."]
pub type NV_ENC_CAPS_PARAM = _NV_ENC_CAPS_PARAM;
#[doc = " Restore encoder state parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_RESTORE_ENCODER_STATE_PARAMS {
    #[doc = "< [in]: Struct version."]
    pub version: u32,
    #[doc = "< [in]: State buffer index to which the encoder state will be restored"]
    pub bufferIdx: u32,
    #[doc = "< [in]: State type to restore"]
    pub state: NV_ENC_STATE_RESTORE_TYPE,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: u32,
    #[doc = "< [in]: Specifies the output buffer pointer, for AV1 encode only."]
    #[doc = "Application must call NvEncRestoreEncoderState() API with _NV_ENC_RESTORE_ENCODER_STATE_PARAMS::outputBitstream and"]
    #[doc = "_NV_ENC_RESTORE_ENCODER_STATE_PARAMS::completionEvent as input when an earlier call to this API returned \"NV_ENC_ERR_NEED_MORE_OUTPUT\", for AV1 encode."]
    pub outputBitstream: NV_ENC_OUTPUT_PTR,
    #[doc = "< [in]: Specifies the completion event when asynchronous mode of encoding is enabled. Used for AV1 encode only."]
    pub completionEvent: *mut ::std::os::raw::c_void,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 64usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_RESTORE_ENCODER_STATE_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>(),
        800usize,
        concat!(
            "Size of: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).version as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).bufferIdx as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(bufferIdx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).state as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).reserved as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).outputBitstream
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(outputBitstream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).completionEvent
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(completionEvent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).reserved1 as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RESTORE_ENCODER_STATE_PARAMS>())).reserved2 as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RESTORE_ENCODER_STATE_PARAMS),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_RESTORE_ENCODER_STATE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Restore encoder state parameters"]
pub type NV_ENC_RESTORE_ENCODER_STATE_PARAMS = _NV_ENC_RESTORE_ENCODER_STATE_PARAMS;
#[doc = " Encoded frame information parameters for every block."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_OUTPUT_STATS_BLOCK {
    #[doc = "< [in]: Struct version"]
    pub version: u32,
    #[doc = "< [out]: QP of the block"]
    pub QP: u8,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u8; 3usize],
    #[doc = "< [out]: Bitcount of the block"]
    pub bitcount: u32,
    #[doc = "< [out]: SATD cost of the residual error"]
    pub satdCost: u32,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 12usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_OUTPUT_STATS_BLOCK() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_OUTPUT_STATS_BLOCK>(),
        64usize,
        concat!("Size of: ", stringify!(_NV_ENC_OUTPUT_STATS_BLOCK))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_OUTPUT_STATS_BLOCK>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_OUTPUT_STATS_BLOCK))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).QP as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(QP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).reserved as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).bitcount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(bitcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).satdCost as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(satdCost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_BLOCK>())).reserved1 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_BLOCK),
            "::",
            stringify!(reserved1)
        )
    );
}
#[doc = " Encoded frame information parameters for every block."]
pub type NV_ENC_OUTPUT_STATS_BLOCK = _NV_ENC_OUTPUT_STATS_BLOCK;
#[doc = " Encoded frame information parameters for every row."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_OUTPUT_STATS_ROW {
    #[doc = "< [in]: Struct version"]
    pub version: u32,
    #[doc = "< [out]: QP of the row"]
    pub QP: u8,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u8; 3usize],
    #[doc = "< [out]: Bitcount of the row"]
    pub bitcount: u32,
    #[doc = "< [out]: SATD cost of the residual error"]
    pub satdCost: u32,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 12usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_OUTPUT_STATS_ROW() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_OUTPUT_STATS_ROW>(),
        64usize,
        concat!("Size of: ", stringify!(_NV_ENC_OUTPUT_STATS_ROW))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_OUTPUT_STATS_ROW>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_OUTPUT_STATS_ROW))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).QP as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(QP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).reserved as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).bitcount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(bitcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).satdCost as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(satdCost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_OUTPUT_STATS_ROW>())).reserved1 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_OUTPUT_STATS_ROW),
            "::",
            stringify!(reserved1)
        )
    );
}
#[doc = " Encoded frame information parameters for every row."]
pub type NV_ENC_OUTPUT_STATS_ROW = _NV_ENC_OUTPUT_STATS_ROW;
#[doc = " Encoder Output parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_ENCODE_OUT_PARAMS {
    #[doc = "< [out]: Struct version."]
    pub version: u32,
    #[doc = "< [out]: Encoded bitstream size in bytes"]
    pub bitstreamSizeInBytes: u32,
    #[doc = "< [out]: Reserved and must be set to 0"]
    pub reserved: [u32; 62usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_ENCODE_OUT_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_ENCODE_OUT_PARAMS>(),
        256usize,
        concat!("Size of: ", stringify!(_NV_ENC_ENCODE_OUT_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_ENCODE_OUT_PARAMS>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_ENCODE_OUT_PARAMS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_ENCODE_OUT_PARAMS>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_ENCODE_OUT_PARAMS),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_ENCODE_OUT_PARAMS>())).bitstreamSizeInBytes as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_ENCODE_OUT_PARAMS),
            "::",
            stringify!(bitstreamSizeInBytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_ENCODE_OUT_PARAMS>())).reserved as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_ENCODE_OUT_PARAMS),
            "::",
            stringify!(reserved)
        )
    );
}
impl Default for _NV_ENC_ENCODE_OUT_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Encoder Output parameters"]
pub type NV_ENC_ENCODE_OUT_PARAMS = _NV_ENC_ENCODE_OUT_PARAMS;
#[doc = " Lookahead picture parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_LOOKAHEAD_PIC_PARAMS {
    #[doc = "< [in]: Struct version."]
    pub version: u32,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: u32,
    #[doc = "< [in]: Specifies the input buffer pointer. Client must use a pointer obtained from ::NvEncCreateInputBuffer() or ::NvEncMapInputResource() APIs."]
    pub inputBuffer: NV_ENC_INPUT_PTR,
    #[doc = "< [in]: Specifies input picture type. Client required to be set explicitly by the client if the client has not set NV_ENC_INITALIZE_PARAMS::enablePTD to 1 while calling NvInitializeEncoder."]
    pub pictureType: NV_ENC_PIC_TYPE,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 63usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_LOOKAHEAD_PIC_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>(),
        784usize,
        concat!("Size of: ", stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).inputBuffer as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(inputBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).pictureType as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(pictureType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).reserved1 as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_LOOKAHEAD_PIC_PARAMS>())).reserved2 as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_LOOKAHEAD_PIC_PARAMS),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_LOOKAHEAD_PIC_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Lookahead picture parameters"]
pub type NV_ENC_LOOKAHEAD_PIC_PARAMS = _NV_ENC_LOOKAHEAD_PIC_PARAMS;
#[doc = " Creation parameters for input buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CREATE_INPUT_BUFFER {
    #[doc = "< [in]: Struct version. Must be set to ::NV_ENC_CREATE_INPUT_BUFFER_VER"]
    pub version: u32,
    #[doc = "< [in]: Input frame width"]
    pub width: u32,
    #[doc = "< [in]: Input frame height"]
    pub height: u32,
    #[doc = "< [in]: Deprecated. Do not use"]
    pub memoryHeap: NV_ENC_MEMORY_HEAP,
    #[doc = "< [in]: Input buffer format"]
    pub bufferFmt: NV_ENC_BUFFER_FORMAT,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: u32,
    #[doc = "< [out]: Pointer to input buffer"]
    pub inputBuffer: NV_ENC_INPUT_PTR,
    #[doc = "< [in]: Pointer to existing system memory buffer"]
    pub pSysMemBuffer: *mut ::std::os::raw::c_void,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 58usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 63usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CREATE_INPUT_BUFFER() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CREATE_INPUT_BUFFER>(),
        776usize,
        concat!("Size of: ", stringify!(_NV_ENC_CREATE_INPUT_BUFFER))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CREATE_INPUT_BUFFER>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CREATE_INPUT_BUFFER))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).width as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).height as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).memoryHeap as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(memoryHeap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).bufferFmt as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(bufferFmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).reserved as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).inputBuffer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(inputBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).pSysMemBuffer as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(pSysMemBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).reserved1 as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_INPUT_BUFFER>())).reserved2 as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_INPUT_BUFFER),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CREATE_INPUT_BUFFER {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Creation parameters for input buffer."]
pub type NV_ENC_CREATE_INPUT_BUFFER = _NV_ENC_CREATE_INPUT_BUFFER;
#[doc = " Creation parameters for output bitstream buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CREATE_BITSTREAM_BUFFER {
    #[doc = "< [in]: Struct version. Must be set to ::NV_ENC_CREATE_BITSTREAM_BUFFER_VER"]
    pub version: u32,
    #[doc = "< [in]: Deprecated. Do not use"]
    pub size: u32,
    #[doc = "< [in]: Deprecated. Do not use"]
    pub memoryHeap: NV_ENC_MEMORY_HEAP,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: u32,
    #[doc = "< [out]: Pointer to the output bitstream buffer"]
    pub bitstreamBuffer: NV_ENC_OUTPUT_PTR,
    #[doc = "< [out]: Reserved and should not be used"]
    pub bitstreamBufferPtr: *mut ::std::os::raw::c_void,
    #[doc = "< [in]: Reserved and should be set to 0"]
    pub reserved1: [u32; 58usize],
    #[doc = "< [in]: Reserved and should be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CREATE_BITSTREAM_BUFFER() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CREATE_BITSTREAM_BUFFER>(),
        776usize,
        concat!("Size of: ", stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CREATE_BITSTREAM_BUFFER>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).size as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).memoryHeap as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(memoryHeap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).reserved as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).bitstreamBuffer as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(bitstreamBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).bitstreamBufferPtr
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(bitstreamBufferPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).reserved1 as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_BITSTREAM_BUFFER>())).reserved2 as *const _
                as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_BITSTREAM_BUFFER),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CREATE_BITSTREAM_BUFFER {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Creation parameters for output bitstream buffer."]
pub type NV_ENC_CREATE_BITSTREAM_BUFFER = _NV_ENC_CREATE_BITSTREAM_BUFFER;
#[doc = " Structs needed for ME only mode."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_MVECTOR {
    #[doc = "< the x component of MV in quarter-pel units"]
    pub mvx: i16,
    #[doc = "< the y component of MV in quarter-pel units"]
    pub mvy: i16,
}
#[test]
fn bindgen_test_layout__NV_ENC_MVECTOR() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_MVECTOR>(),
        4usize,
        concat!("Size of: ", stringify!(_NV_ENC_MVECTOR))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_MVECTOR>(),
        2usize,
        concat!("Alignment of ", stringify!(_NV_ENC_MVECTOR))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_MVECTOR>())).mvx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_MVECTOR),
            "::",
            stringify!(mvx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_MVECTOR>())).mvy as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_MVECTOR),
            "::",
            stringify!(mvy)
        )
    );
}
#[doc = " Structs needed for ME only mode."]
pub type NV_ENC_MVECTOR = _NV_ENC_MVECTOR;
#[doc = " Motion vector structure per macroblock for H264 motion estimation."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_H264_MV_DATA {
    #[doc = "< up to 4 vectors for 8x8 partition"]
    pub mv: [NV_ENC_MVECTOR; 4usize],
    #[doc = "< 0 (I), 1 (P), 2 (IPCM), 3 (B)"]
    pub mbType: u8,
    #[doc = "< Specifies the block partition type. 0:16x16, 1:8x8, 2:16x8, 3:8x16"]
    pub partitionType: u8,
    #[doc = "< reserved padding for alignment"]
    pub reserved: u16,
    pub mbCost: u32,
}
#[test]
fn bindgen_test_layout__NV_ENC_H264_MV_DATA() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_H264_MV_DATA>(),
        24usize,
        concat!("Size of: ", stringify!(_NV_ENC_H264_MV_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_H264_MV_DATA>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_H264_MV_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_H264_MV_DATA>())).mv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_H264_MV_DATA),
            "::",
            stringify!(mv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_H264_MV_DATA>())).mbType as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_H264_MV_DATA),
            "::",
            stringify!(mbType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_H264_MV_DATA>())).partitionType as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_H264_MV_DATA),
            "::",
            stringify!(partitionType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_H264_MV_DATA>())).reserved as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_H264_MV_DATA),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_H264_MV_DATA>())).mbCost as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_H264_MV_DATA),
            "::",
            stringify!(mbCost)
        )
    );
}
#[doc = " Motion vector structure per macroblock for H264 motion estimation."]
pub type NV_ENC_H264_MV_DATA = _NV_ENC_H264_MV_DATA;
#[doc = " Motion vector structure per CU for HEVC motion estimation."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_HEVC_MV_DATA {
    #[doc = "< up to 4 vectors within a CU"]
    pub mv: [NV_ENC_MVECTOR; 4usize],
    #[doc = "< 0 (I), 1(P)"]
    pub cuType: u8,
    #[doc = "< 0: 8x8, 1: 16x16, 2: 32x32, 3: 64x64"]
    pub cuSize: u8,
    #[doc = "< The CU partition mode"]
    #[doc = "0 (2Nx2N), 1 (2NxN), 2(Nx2N), 3 (NxN),"]
    #[doc = "4 (2NxnU), 5 (2NxnD), 6(nLx2N), 7 (nRx2N)"]
    pub partitionMode: u8,
    #[doc = "< Marker to separate CUs in the current CTB from CUs in the next CTB"]
    pub lastCUInCTB: u8,
}
#[test]
fn bindgen_test_layout__NV_ENC_HEVC_MV_DATA() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_HEVC_MV_DATA>(),
        20usize,
        concat!("Size of: ", stringify!(_NV_ENC_HEVC_MV_DATA))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_HEVC_MV_DATA>(),
        2usize,
        concat!("Alignment of ", stringify!(_NV_ENC_HEVC_MV_DATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_HEVC_MV_DATA>())).mv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_HEVC_MV_DATA),
            "::",
            stringify!(mv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_HEVC_MV_DATA>())).cuType as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_HEVC_MV_DATA),
            "::",
            stringify!(cuType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_HEVC_MV_DATA>())).cuSize as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_HEVC_MV_DATA),
            "::",
            stringify!(cuSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_HEVC_MV_DATA>())).partitionMode as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_HEVC_MV_DATA),
            "::",
            stringify!(partitionMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_HEVC_MV_DATA>())).lastCUInCTB as *const _ as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_HEVC_MV_DATA),
            "::",
            stringify!(lastCUInCTB)
        )
    );
}
#[doc = " Motion vector structure per CU for HEVC motion estimation."]
pub type NV_ENC_HEVC_MV_DATA = _NV_ENC_HEVC_MV_DATA;
#[doc = " Creation parameters for output motion vector buffer for ME only mode."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CREATE_MV_BUFFER {
    #[doc = "< [in]: Struct version. Must be set to NV_ENC_CREATE_MV_BUFFER_VER"]
    pub version: u32,
    #[doc = "< [in]: Reserved and should be set to 0"]
    pub reserved: u32,
    #[doc = "< [out]: Pointer to the output motion vector buffer"]
    pub mvBuffer: NV_ENC_OUTPUT_PTR,
    #[doc = "< [in]: Reserved and should be set to 0"]
    pub reserved1: [u32; 254usize],
    #[doc = "< [in]: Reserved and should be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 63usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CREATE_MV_BUFFER() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CREATE_MV_BUFFER>(),
        1536usize,
        concat!("Size of: ", stringify!(_NV_ENC_CREATE_MV_BUFFER))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CREATE_MV_BUFFER>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CREATE_MV_BUFFER))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_MV_BUFFER>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_MV_BUFFER),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_MV_BUFFER>())).reserved as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_MV_BUFFER),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_MV_BUFFER>())).mvBuffer as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_MV_BUFFER),
            "::",
            stringify!(mvBuffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_MV_BUFFER>())).reserved1 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_MV_BUFFER),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CREATE_MV_BUFFER>())).reserved2 as *const _ as usize
        },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CREATE_MV_BUFFER),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CREATE_MV_BUFFER {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Creation parameters for output motion vector buffer for ME only mode."]
pub type NV_ENC_CREATE_MV_BUFFER = _NV_ENC_CREATE_MV_BUFFER;
#[doc = " QP value for frames"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_QP {
    #[doc = "< [in]: Specifies QP value for P-frame. Even though this field is uint32_t for legacy reasons, the client should treat this as a signed parameter(int32_t) for cases in which negative QP values are to be specified."]
    pub qpInterP: u32,
    #[doc = "< [in]: Specifies QP value for B-frame. Even though this field is uint32_t for legacy reasons, the client should treat this as a signed parameter(int32_t) for cases in which negative QP values are to be specified."]
    pub qpInterB: u32,
    #[doc = "< [in]: Specifies QP value for Intra Frame. Even though this field is uint32_t for legacy reasons, the client should treat this as a signed parameter(int32_t) for cases in which negative QP values are to be specified."]
    pub qpIntra: u32,
}
#[test]
fn bindgen_test_layout__NV_ENC_QP() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_QP>(),
        12usize,
        concat!("Size of: ", stringify!(_NV_ENC_QP))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_QP>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_QP))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_QP>())).qpInterP as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_QP),
            "::",
            stringify!(qpInterP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_QP>())).qpInterB as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_QP),
            "::",
            stringify!(qpInterB)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_QP>())).qpIntra as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_QP),
            "::",
            stringify!(qpIntra)
        )
    );
}
#[doc = " QP value for frames"]
pub type NV_ENC_QP = _NV_ENC_QP;
#[doc = " Rate Control Configuration Parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_RC_PARAMS {
    pub version: u32,
    #[doc = "< [in]: Specifies the rate control mode. Check support for various rate control modes using ::NV_ENC_CAPS_SUPPORTED_RATECONTROL_MODES caps."]
    pub rateControlMode: NV_ENC_PARAMS_RC_MODE,
    #[doc = "< [in]: Specifies the initial QP to be used for encoding, these values would be used for all frames if in Constant QP mode."]
    pub constQP: NV_ENC_QP,
    #[doc = "< [in]: Specifies the average bitrate(in bits/sec) used for encoding."]
    pub averageBitRate: u32,
    #[doc = "< [in]: Specifies the maximum bitrate for the encoded output. This is used for VBR and ignored for CBR mode."]
    pub maxBitRate: u32,
    #[doc = "< [in]: Specifies the VBV(HRD) buffer size. in bits. Set 0 to use the default VBV  buffer size."]
    pub vbvBufferSize: u32,
    #[doc = "< [in]: Specifies the VBV(HRD) initial delay in bits. Set 0 to use the default VBV  initial delay ."]
    pub vbvInitialDelay: u32,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Specifies the minimum QP used for rate control. Client must set NV_ENC_CONFIG::enableMinQP to 1."]
    pub minQP: NV_ENC_QP,
    #[doc = "< [in]: Specifies the maximum QP used for rate control. Client must set NV_ENC_CONFIG::enableMaxQP to 1."]
    pub maxQP: NV_ENC_QP,
    #[doc = "< [in]: Specifies the initial QP hint used for rate control. The parameter is just used as hint to influence the QP difference between I,P and B frames."]
    #[doc = "Client must set NV_ENC_CONFIG::enableInitialRCQP to 1."]
    pub initialRCQP: NV_ENC_QP,
    #[doc = "< [in]: Specifies the temporal layers (as a bitmask) whose QPs have changed. Valid max bitmask is [2^NV_ENC_CAPS_NUM_MAX_TEMPORAL_LAYERS - 1]."]
    #[doc = "Applicable only for constant QP mode (NV_ENC_RC_PARAMS::rateControlMode = NV_ENC_PARAMS_RC_CONSTQP)."]
    pub temporallayerIdxMask: u32,
    #[doc = "< [in]: Specifies the temporal layer QPs used for rate control. Temporal layer index is used as the array index."]
    #[doc = "Applicable only for constant QP mode (NV_ENC_RC_PARAMS::rateControlMode = NV_ENC_PARAMS_RC_CONSTQP)."]
    pub temporalLayerQP: [u8; 8usize],
    #[doc = "< [in]: Target CQ (Constant Quality) level for VBR mode (range 0-51 for H264/HEVC, 0-63 for AV1 with 0-automatic)"]
    pub targetQuality: u8,
    #[doc = "< [in]: Fractional part of target quality (as 8.8 fixed point format)"]
    pub targetQualityLSB: u8,
    #[doc = "< [in]: Maximum depth of lookahead with range 0-(31 - number of B frames)."]
    #[doc = "lookaheadDepth is only used if enableLookahead=1."]
    pub lookaheadDepth: u16,
    #[doc = "< [in]: Specifies the ratio of I frame bits to P frame bits in case of single frame VBV and CBR rate control mode,"]
    #[doc = "is set to 2 by default for low latency tuning info and 1 by default for ultra low latency tuning info"]
    pub lowDelayKeyFrameScale: u8,
    #[doc = "< [in]: Specifies the value of 'deltaQ_y_dc' in AV1."]
    pub yDcQPIndexOffset: i8,
    #[doc = "< [in]: Specifies the value of 'deltaQ_u_dc' in AV1."]
    pub uDcQPIndexOffset: i8,
    #[doc = "< [in]: Specifies the value of 'deltaQ_v_dc' in AV1 (for future use only - deltaQ_v_dc is currently always internally set to same value as deltaQ_u_dc)."]
    pub vDcQPIndexOffset: i8,
    #[doc = "< [in]: This flag is used to interpret values in array specified by NV_ENC_PIC_PARAMS::qpDeltaMap."]
    #[doc = "Set this to NV_ENC_QP_MAP_EMPHASIS to treat values specified by NV_ENC_PIC_PARAMS::qpDeltaMap as Emphasis Level Map."]
    #[doc = "Emphasis Level can be assigned any value specified in enum NV_ENC_EMPHASIS_MAP_LEVEL."]
    #[doc = "Emphasis Level Map is used to specify regions to be encoded at varying levels of quality."]
    #[doc = "The hardware encoder adjusts the quantization within the image as per the provided emphasis map,"]
    #[doc = "by adjusting the quantization parameter (QP) assigned to each macroblock. This adjustment is commonly called \"Delta QP\"."]
    #[doc = "The adjustment depends on the absolute QP decided by the rate control algorithm, and is applied after the rate control has decided each macroblock's QP."]
    #[doc = "Since the Delta QP overrides rate control, enabling Emphasis Level Map may violate bitrate and VBV buffer size constraints."]
    #[doc = "Emphasis Level Map is useful in situations where client has a priori knowledge of the image complexity (e.g. via use of NVFBC's Classification feature) and encoding those high-complexity areas at higher quality (lower QP) is important, even at the possible cost of violating bitrate/VBV buffer size constraints"]
    #[doc = "This feature is not supported when AQ( Spatial/Temporal) is enabled."]
    #[doc = "This feature is only supported for H264 codec currently."]
    #[doc = ""]
    #[doc = "Set this to NV_ENC_QP_MAP_DELTA to treat values specified by NV_ENC_PIC_PARAMS::qpDeltaMap as QP Delta. This specifies QP modifier to be applied on top of the QP chosen by rate control"]
    #[doc = ""]
    #[doc = "Set this to NV_ENC_QP_MAP_DISABLED to ignore NV_ENC_PIC_PARAMS::qpDeltaMap values. In this case, qpDeltaMap should be set to NULL."]
    #[doc = ""]
    #[doc = "Other values are reserved for future use."]
    pub qpMapMode: NV_ENC_QP_MAP_MODE,
    #[doc = "< [in]: This flag is used to enable multi-pass encoding for a given ::NV_ENC_PARAMS_RC_MODE. This flag is not valid for H264 and HEVC MEOnly mode"]
    pub multiPass: NV_ENC_MULTI_PASS,
    #[doc = "< [in]: Specifies the ratio in which bitrate should be split between base and alpha layer. A value 'x' for this field will split the target bitrate in a ratio of x : 1 between base and alpha layer."]
    #[doc = "The default split ratio is 15."]
    pub alphaLayerBitrateRatio: u32,
    #[doc = "< [in]: Specifies the value of 'chroma_qp_index_offset' in H264 / 'pps_cb_qp_offset' in HEVC / 'deltaQ_u_ac' in AV1."]
    pub cbQPIndexOffset: i8,
    #[doc = "< [in]: Specifies the value of 'second_chroma_qp_index_offset' in H264 / 'pps_cr_qp_offset' in HEVC / 'deltaQ_v_ac' in AV1 (for future use only - deltaQ_v_ac is currently always internally set to same value as deltaQ_u_ac)."]
    pub crQPIndexOffset: i8,
    pub reserved2: u16,
    #[doc = "< [in]: Specifies the lookahead level. Higher level may improve quality at the expense of performance."]
    pub lookaheadLevel: NV_ENC_LOOKAHEAD_LEVEL,
    #[doc = "< [in]: Specifies the bit rate ratio for each view of MV-HEVC except the base view."]
    #[doc = "The base view bit rate ratio = 100 - (sum of bit rate ratio of all other views)."]
    pub viewBitrateRatios: [u8; 7usize],
    pub reserved3: u8,
    pub reserved1: u32,
}
#[test]
fn bindgen_test_layout__NV_ENC_RC_PARAMS() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_RC_PARAMS>(),
        128usize,
        concat!("Size of: ", stringify!(_NV_ENC_RC_PARAMS))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_RC_PARAMS>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_RC_PARAMS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).rateControlMode as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(rateControlMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).constQP as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(constQP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).averageBitRate as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(averageBitRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).maxBitRate as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(maxBitRate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).vbvBufferSize as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(vbvBufferSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).vbvInitialDelay as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(vbvInitialDelay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).minQP as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(minQP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).maxQP as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(maxQP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).initialRCQP as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(initialRCQP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).temporallayerIdxMask as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(temporallayerIdxMask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).temporalLayerQP as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(temporalLayerQP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).targetQuality as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(targetQuality)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).targetQualityLSB as *const _ as usize
        },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(targetQualityLSB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).lookaheadDepth as *const _ as usize
        },
        90usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(lookaheadDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).lowDelayKeyFrameScale as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(lowDelayKeyFrameScale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).yDcQPIndexOffset as *const _ as usize
        },
        93usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(yDcQPIndexOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).uDcQPIndexOffset as *const _ as usize
        },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(uDcQPIndexOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).vDcQPIndexOffset as *const _ as usize
        },
        95usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(vDcQPIndexOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).qpMapMode as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(qpMapMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).multiPass as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(multiPass)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).alphaLayerBitrateRatio as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(alphaLayerBitrateRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).cbQPIndexOffset as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(cbQPIndexOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).crQPIndexOffset as *const _ as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(crQPIndexOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).reserved2 as *const _ as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).lookaheadLevel as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(lookaheadLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).viewBitrateRatios as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(viewBitrateRatios)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).reserved3 as *const _ as usize },
        123usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_RC_PARAMS>())).reserved1 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_RC_PARAMS),
            "::",
            stringify!(reserved1)
        )
    );
}
impl Default for _NV_ENC_RC_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_ENC_RC_PARAMS {
    #[inline]
    pub fn enableMinQP(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableMinQP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableMaxQP(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableMaxQP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableInitialRCQP(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableInitialRCQP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableAQ(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableAQ(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedBitField1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reservedBitField1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableLookahead(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableLookahead(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableIadapt(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableIadapt(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableBadapt(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableBadapt(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableTemporalAQ(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTemporalAQ(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn zeroReorderDelay(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_zeroReorderDelay(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableNonRefP(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableNonRefP(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn strictGOPTarget(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_strictGOPTarget(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn aqStrength(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_aqStrength(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn enableExtLookahead(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableExtLookahead(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedBitFields(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_reservedBitFields(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enableMinQP: u32,
        enableMaxQP: u32,
        enableInitialRCQP: u32,
        enableAQ: u32,
        reservedBitField1: u32,
        enableLookahead: u32,
        disableIadapt: u32,
        disableBadapt: u32,
        enableTemporalAQ: u32,
        zeroReorderDelay: u32,
        enableNonRefP: u32,
        strictGOPTarget: u32,
        aqStrength: u32,
        enableExtLookahead: u32,
        reservedBitFields: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enableMinQP: u32 = unsafe { ::std::mem::transmute(enableMinQP) };
            enableMinQP as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enableMaxQP: u32 = unsafe { ::std::mem::transmute(enableMaxQP) };
            enableMaxQP as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let enableInitialRCQP: u32 = unsafe { ::std::mem::transmute(enableInitialRCQP) };
            enableInitialRCQP as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let enableAQ: u32 = unsafe { ::std::mem::transmute(enableAQ) };
            enableAQ as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let reservedBitField1: u32 = unsafe { ::std::mem::transmute(reservedBitField1) };
            reservedBitField1 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let enableLookahead: u32 = unsafe { ::std::mem::transmute(enableLookahead) };
            enableLookahead as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let disableIadapt: u32 = unsafe { ::std::mem::transmute(disableIadapt) };
            disableIadapt as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let disableBadapt: u32 = unsafe { ::std::mem::transmute(disableBadapt) };
            disableBadapt as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let enableTemporalAQ: u32 = unsafe { ::std::mem::transmute(enableTemporalAQ) };
            enableTemporalAQ as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let zeroReorderDelay: u32 = unsafe { ::std::mem::transmute(zeroReorderDelay) };
            zeroReorderDelay as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let enableNonRefP: u32 = unsafe { ::std::mem::transmute(enableNonRefP) };
            enableNonRefP as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let strictGOPTarget: u32 = unsafe { ::std::mem::transmute(strictGOPTarget) };
            strictGOPTarget as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let aqStrength: u32 = unsafe { ::std::mem::transmute(aqStrength) };
            aqStrength as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let enableExtLookahead: u32 = unsafe { ::std::mem::transmute(enableExtLookahead) };
            enableExtLookahead as u64
        });
        __bindgen_bitfield_unit.set(17usize, 15u8, {
            let reservedBitFields: u32 = unsafe { ::std::mem::transmute(reservedBitFields) };
            reservedBitFields as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Rate Control Configuration Parameters"]
pub type NV_ENC_RC_PARAMS = _NV_ENC_RC_PARAMS;
#[doc = " Clock Timestamp set parameters"]
#[doc = " For H264, this structure is used to populate Picture Timing SEI when NV_ENC_CONFIG_H264::enableTimeCode is set to 1."]
#[doc = " For HEVC, this structure is used to populate Time Code SEI when NV_ENC_CONFIG_HEVC::enableTimeCodeSEI is set to 1."]
#[doc = " For more details, refer to Annex D of ITU-T Specification."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CLOCK_TIMESTAMP_SET {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in] Specifies the 'time_offset_value'"]
    pub timeOffset: u32,
}
#[test]
fn bindgen_test_layout__NV_ENC_CLOCK_TIMESTAMP_SET() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CLOCK_TIMESTAMP_SET>(),
        8usize,
        concat!("Size of: ", stringify!(_NV_ENC_CLOCK_TIMESTAMP_SET))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CLOCK_TIMESTAMP_SET>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CLOCK_TIMESTAMP_SET))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CLOCK_TIMESTAMP_SET>())).timeOffset as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CLOCK_TIMESTAMP_SET),
            "::",
            stringify!(timeOffset)
        )
    );
}
impl _NV_ENC_CLOCK_TIMESTAMP_SET {
    #[inline]
    pub fn countingType(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_countingType(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn discontinuityFlag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_discontinuityFlag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cntDroppedFrames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cntDroppedFrames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nFrames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_nFrames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn secondsValue(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_secondsValue(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn minutesValue(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_minutesValue(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn hoursValue(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_hoursValue(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        countingType: u32,
        discontinuityFlag: u32,
        cntDroppedFrames: u32,
        nFrames: u32,
        secondsValue: u32,
        minutesValue: u32,
        hoursValue: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let countingType: u32 = unsafe { ::std::mem::transmute(countingType) };
            countingType as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let discontinuityFlag: u32 = unsafe { ::std::mem::transmute(discontinuityFlag) };
            discontinuityFlag as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let cntDroppedFrames: u32 = unsafe { ::std::mem::transmute(cntDroppedFrames) };
            cntDroppedFrames as u64
        });
        __bindgen_bitfield_unit.set(3usize, 8u8, {
            let nFrames: u32 = unsafe { ::std::mem::transmute(nFrames) };
            nFrames as u64
        });
        __bindgen_bitfield_unit.set(11usize, 6u8, {
            let secondsValue: u32 = unsafe { ::std::mem::transmute(secondsValue) };
            secondsValue as u64
        });
        __bindgen_bitfield_unit.set(17usize, 6u8, {
            let minutesValue: u32 = unsafe { ::std::mem::transmute(minutesValue) };
            minutesValue as u64
        });
        __bindgen_bitfield_unit.set(23usize, 5u8, {
            let hoursValue: u32 = unsafe { ::std::mem::transmute(hoursValue) };
            hoursValue as u64
        });
        __bindgen_bitfield_unit.set(28usize, 4u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Clock Timestamp set parameters"]
#[doc = " For H264, this structure is used to populate Picture Timing SEI when NV_ENC_CONFIG_H264::enableTimeCode is set to 1."]
#[doc = " For HEVC, this structure is used to populate Time Code SEI when NV_ENC_CONFIG_HEVC::enableTimeCodeSEI is set to 1."]
#[doc = " For more details, refer to Annex D of ITU-T Specification."]
pub type NV_ENC_CLOCK_TIMESTAMP_SET = _NV_ENC_CLOCK_TIMESTAMP_SET;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_TIME_CODE {
    #[doc = "< [in] Display picStruct"]
    pub displayPicStruct: NV_ENC_DISPLAY_PIC_STRUCT,
    #[doc = "< [in] Clock Timestamp set"]
    pub clockTimestamp: [NV_ENC_CLOCK_TIMESTAMP_SET; 3usize],
    #[doc = "< [in] 0 : Inserts Clock Timestamp if NV_ENC_CONFIG_H264::enableTimeCode (H264) or"]
    #[doc = "NV_ENC_CONFIG_HEVC::outputTimeCodeSEI (HEVC) is specified"]
    #[doc = "1 : Skips insertion of Clock Timestamp for current frame"]
    pub skipClockTimestampInsertion: u32,
}
#[test]
fn bindgen_test_layout__NV_ENC_TIME_CODE() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_TIME_CODE>(),
        32usize,
        concat!("Size of: ", stringify!(_NV_ENC_TIME_CODE))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_TIME_CODE>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_TIME_CODE))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_TIME_CODE>())).displayPicStruct as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_TIME_CODE),
            "::",
            stringify!(displayPicStruct)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_TIME_CODE>())).clockTimestamp as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_TIME_CODE),
            "::",
            stringify!(clockTimestamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_TIME_CODE>())).skipClockTimestampInsertion as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_TIME_CODE),
            "::",
            stringify!(skipClockTimestampInsertion)
        )
    );
}
impl Default for _NV_ENC_TIME_CODE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type NV_ENC_TIME_CODE = _NV_ENC_TIME_CODE;
#[doc = " G.14.2.3 3D reference displays information SEI message syntax elements"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _HEVC_3D_REFERENCE_DISPLAY_INFO {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in] Specifies the exponent of the maximum allowable truncation error for refDisplayWidth[i]. Range 0-31, inclusive."]
    pub precRefDisplayWidth: i32,
    #[doc = "< [in] Specifies the exponent of the maximum allowable truncation error for refViewingDist[i]. Range 0-31, inclusive."]
    pub precRefViewingDist: i32,
    #[doc = "< [in] Plus 1 specifies the number of reference displays that are signalled in this SEI message. Range 0-31, inclusive."]
    pub numRefDisplaysMinus1: i32,
    #[doc = "< [in] Indicates the ViewId of the left view of a stereo pair corresponding to the i-th reference display."]
    pub leftViewId: [i32; 32usize],
    #[doc = "< [in] Indicates the ViewId of the right view of a stereo-pair corresponding to the i-th reference display."]
    pub rightViewId: [i32; 32usize],
    #[doc = "< [in] Specifies the exponent part of the reference display width of the i-th reference display."]
    pub exponentRefDisplayWidth: [i32; 32usize],
    #[doc = "< [in] Specifies the mantissa part of the reference display width of the i-th reference display."]
    pub mantissaRefDisplayWidth: [i32; 32usize],
    #[doc = "< [in] Specifies the exponent part of the reference viewing distance of the i-th reference display."]
    pub exponentRefViewingDistance: [i32; 32usize],
    #[doc = "< [in] Specifies the mantissa part of the reference viewing distance of the i-th reference display."]
    pub mantissaRefViewingDistance: [i32; 32usize],
    #[doc = "< [in] Indicates the recommended additional horizontal shift for a stereo pair corresponding to the i-th reference baseline and the i-th reference display."]
    pub numSampleShiftPlus512: [i32; 32usize],
    #[doc = "< [in] Equal to 1 indicates that the information about additional horizontal shift of the left and right views for the i-th reference display is present in this SEI message."]
    pub additionalShiftPresentFlag: [u8; 32usize],
    #[doc = "< [in] Reserved and must be set to 0"]
    pub reserved2: [u32; 4usize],
}
#[test]
fn bindgen_test_layout__HEVC_3D_REFERENCE_DISPLAY_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_HEVC_3D_REFERENCE_DISPLAY_INFO>(),
        960usize,
        concat!("Size of: ", stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_HEVC_3D_REFERENCE_DISPLAY_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).precRefDisplayWidth
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(precRefDisplayWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).precRefViewingDist
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(precRefViewingDist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).numRefDisplaysMinus1
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(numRefDisplaysMinus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).leftViewId as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(leftViewId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).rightViewId as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(rightViewId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).exponentRefDisplayWidth
                as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(exponentRefDisplayWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).mantissaRefDisplayWidth
                as *const _ as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(mantissaRefDisplayWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).exponentRefViewingDistance
                as *const _ as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(exponentRefViewingDistance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).mantissaRefViewingDistance
                as *const _ as usize
        },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(mantissaRefViewingDistance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).numSampleShiftPlus512
                as *const _ as usize
        },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(numSampleShiftPlus512)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).additionalShiftPresentFlag
                as *const _ as usize
        },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(additionalShiftPresentFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_HEVC_3D_REFERENCE_DISPLAY_INFO>())).reserved2 as *const _
                as usize
        },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(_HEVC_3D_REFERENCE_DISPLAY_INFO),
            "::",
            stringify!(reserved2)
        )
    );
}
impl _HEVC_3D_REFERENCE_DISPLAY_INFO {
    #[inline]
    pub fn refViewingDistanceFlag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_refViewingDistanceFlag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn threeDimensionalReferenceDisplaysExtensionFlag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_threeDimensionalReferenceDisplaysExtensionFlag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        refViewingDistanceFlag: u32,
        threeDimensionalReferenceDisplaysExtensionFlag: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let refViewingDistanceFlag: u32 =
                unsafe { ::std::mem::transmute(refViewingDistanceFlag) };
            refViewingDistanceFlag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let threeDimensionalReferenceDisplaysExtensionFlag: u32 =
                unsafe { ::std::mem::transmute(threeDimensionalReferenceDisplaysExtensionFlag) };
            threeDimensionalReferenceDisplaysExtensionFlag as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " G.14.2.3 3D reference displays information SEI message syntax elements"]
pub type HEVC_3D_REFERENCE_DISPLAY_INFO = _HEVC_3D_REFERENCE_DISPLAY_INFO;
#[doc = " Struct for storing x and y chroma points"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CHROMA_POINTS {
    pub x: u16,
    pub y: u16,
}
#[test]
fn bindgen_test_layout__CHROMA_POINTS() {
    assert_eq!(
        ::std::mem::size_of::<_CHROMA_POINTS>(),
        4usize,
        concat!("Size of: ", stringify!(_CHROMA_POINTS))
    );
    assert_eq!(
        ::std::mem::align_of::<_CHROMA_POINTS>(),
        2usize,
        concat!("Alignment of ", stringify!(_CHROMA_POINTS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CHROMA_POINTS>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CHROMA_POINTS),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_CHROMA_POINTS>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CHROMA_POINTS),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " Struct for storing x and y chroma points"]
pub type CHROMA_POINTS = _CHROMA_POINTS;
#[doc = " Struct for storing mastering-display information"]
#[doc = " Refer to the AV1 spec 6.7.4 Metadata high dynamic range mastering display color volume semantics OR"]
#[doc = " HEVC spec D.2.28 Mastering display colour volume SEI message syntax"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _MASTERING_DISPLAY_INFO {
    pub g: CHROMA_POINTS,
    pub b: CHROMA_POINTS,
    pub r: CHROMA_POINTS,
    pub whitePoint: CHROMA_POINTS,
    pub maxLuma: u32,
    pub minLuma: u32,
}
#[test]
fn bindgen_test_layout__MASTERING_DISPLAY_INFO() {
    assert_eq!(
        ::std::mem::size_of::<_MASTERING_DISPLAY_INFO>(),
        24usize,
        concat!("Size of: ", stringify!(_MASTERING_DISPLAY_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<_MASTERING_DISPLAY_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(_MASTERING_DISPLAY_INFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).g as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).b as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).r as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).whitePoint as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(whitePoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).maxLuma as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(maxLuma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MASTERING_DISPLAY_INFO>())).minLuma as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_MASTERING_DISPLAY_INFO),
            "::",
            stringify!(minLuma)
        )
    );
}
#[doc = " Struct for storing mastering-display information"]
#[doc = " Refer to the AV1 spec 6.7.4 Metadata high dynamic range mastering display color volume semantics OR"]
#[doc = " HEVC spec D.2.28 Mastering display colour volume SEI message syntax"]
pub type MASTERING_DISPLAY_INFO = _MASTERING_DISPLAY_INFO;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _CONTENT_LIGHT_LEVEL {
    pub maxContentLightLevel: u16,
    pub maxPicAverageLightLevel: u16,
}
#[test]
fn bindgen_test_layout__CONTENT_LIGHT_LEVEL() {
    assert_eq!(
        ::std::mem::size_of::<_CONTENT_LIGHT_LEVEL>(),
        4usize,
        concat!("Size of: ", stringify!(_CONTENT_LIGHT_LEVEL))
    );
    assert_eq!(
        ::std::mem::align_of::<_CONTENT_LIGHT_LEVEL>(),
        2usize,
        concat!("Alignment of ", stringify!(_CONTENT_LIGHT_LEVEL))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CONTENT_LIGHT_LEVEL>())).maxContentLightLevel as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTENT_LIGHT_LEVEL),
            "::",
            stringify!(maxContentLightLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_CONTENT_LIGHT_LEVEL>())).maxPicAverageLightLevel as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_CONTENT_LIGHT_LEVEL),
            "::",
            stringify!(maxPicAverageLightLevel)
        )
    );
}
pub type CONTENT_LIGHT_LEVEL = _CONTENT_LIGHT_LEVEL;
#[doc = " \\struct _NV_ENC_CONFIG_H264_VUI_PARAMETERS"]
#[doc = " H264 Video Usability Info parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_H264_VUI_PARAMETERS {
    #[doc = "< [in]: If set to 1 , it specifies that the overscanInfo is present"]
    pub overscanInfoPresentFlag: u32,
    #[doc = "< [in]: Specifies the overscan info(as defined in Annex E of the ITU-T Specification)."]
    pub overscanInfo: u32,
    #[doc = "< [in]: If set to 1, it specifies  that the videoFormat, videoFullRangeFlag and colourDescriptionPresentFlag are present."]
    pub videoSignalTypePresentFlag: u32,
    #[doc = "< [in]: Specifies the source video format(as defined in Annex E of the ITU-T Specification)."]
    pub videoFormat: NV_ENC_VUI_VIDEO_FORMAT,
    #[doc = "< [in]: Specifies the output range of the luma and chroma samples(as defined in Annex E of the ITU-T Specification)."]
    pub videoFullRangeFlag: u32,
    #[doc = "< [in]: If set to 1, it specifies that the colourPrimaries, transferCharacteristics and colourMatrix are present."]
    pub colourDescriptionPresentFlag: u32,
    #[doc = "< [in]: Specifies color primaries for converting to RGB(as defined in Annex E of the ITU-T Specification)"]
    pub colourPrimaries: NV_ENC_VUI_COLOR_PRIMARIES,
    #[doc = "< [in]: Specifies the opto-electronic transfer characteristics to use (as defined in Annex E of the ITU-T Specification)"]
    pub transferCharacteristics: NV_ENC_VUI_TRANSFER_CHARACTERISTIC,
    #[doc = "< [in]: Specifies the matrix coefficients used in deriving the luma and chroma from the RGB primaries (as defined in Annex E of the ITU-T Specification)."]
    pub colourMatrix: NV_ENC_VUI_MATRIX_COEFFS,
    #[doc = "< [in]: If set to 1 , it specifies that the chromaSampleLocationTop and chromaSampleLocationBot are present."]
    pub chromaSampleLocationFlag: u32,
    #[doc = "< [in]: Specifies the chroma sample location for top field(as defined in Annex E of the ITU-T Specification)"]
    pub chromaSampleLocationTop: u32,
    #[doc = "< [in]: Specifies the chroma sample location for bottom field(as defined in Annex E of the ITU-T Specification)"]
    pub chromaSampleLocationBot: u32,
    #[doc = "< [in]: If set to 1, it specifies the bitstream restriction parameters are present in the bitstream."]
    pub bitstreamRestrictionFlag: u32,
    #[doc = "< [in]: If set to 1, it specifies that the timingInfo is present and the 'numUnitInTicks' and 'timeScale' fields are specified by the application. */"]
    pub timingInfoPresentFlag: u32,
    #[doc = "< [in]: Specifies the number of time units of the clock(as defined in Annex E of the ITU-T Specification)."]
    pub numUnitInTicks: u32,
    #[doc = "< [in]: Specifies the frquency of the clock(as defined in Annex E of the ITU-T Specification)."]
    pub timeScale: u32,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u32; 12usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_H264_VUI_PARAMETERS() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>(),
        112usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).overscanInfoPresentFlag
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(overscanInfoPresentFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).overscanInfo as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(overscanInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>()))
                .videoSignalTypePresentFlag as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(videoSignalTypePresentFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).videoFormat as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(videoFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).videoFullRangeFlag
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(videoFullRangeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>()))
                .colourDescriptionPresentFlag as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(colourDescriptionPresentFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).colourPrimaries
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(colourPrimaries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).transferCharacteristics
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(transferCharacteristics)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).colourMatrix as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(colourMatrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).chromaSampleLocationFlag
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(chromaSampleLocationFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).chromaSampleLocationTop
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(chromaSampleLocationTop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).chromaSampleLocationBot
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(chromaSampleLocationBot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).bitstreamRestrictionFlag
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(bitstreamRestrictionFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).timingInfoPresentFlag
                as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(timingInfoPresentFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).numUnitInTicks
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(numUnitInTicks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).timeScale as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(timeScale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_VUI_PARAMETERS>())).reserved as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_VUI_PARAMETERS),
            "::",
            stringify!(reserved)
        )
    );
}
impl Default for _NV_ENC_CONFIG_H264_VUI_PARAMETERS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_H264_VUI_PARAMETERS"]
#[doc = " H264 Video Usability Info parameters"]
pub type NV_ENC_CONFIG_H264_VUI_PARAMETERS = _NV_ENC_CONFIG_H264_VUI_PARAMETERS;
#[doc = " \\struct _NV_ENC_CONFIG_H264_VUI_PARAMETERS"]
#[doc = " H264 Video Usability Info parameters"]
pub type NV_ENC_CONFIG_HEVC_VUI_PARAMETERS = NV_ENC_CONFIG_H264_VUI_PARAMETERS;
#[doc = " \\struct _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE"]
#[doc = " External motion vector hint counts per block type."]
#[doc = " H264 and AV1 support multiple hint while HEVC supports one hint for each valid candidate."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Reserved for future use."]
    pub reserved1: [u32; 3usize],
}
#[test]
fn bindgen_test_layout__NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE() {
    assert_eq!(
        ::std::mem::size_of::<_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE>())).reserved1
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE),
            "::",
            stringify!(reserved1)
        )
    );
}
impl _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE {
    #[inline]
    pub fn numCandsPerBlk16x16(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCandsPerBlk16x16(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCandsPerBlk16x8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCandsPerBlk16x8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCandsPerBlk8x16(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCandsPerBlk8x16(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCandsPerBlk8x8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCandsPerBlk8x8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCandsPerSb(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_numCandsPerSb(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        numCandsPerBlk16x16: u32,
        numCandsPerBlk16x8: u32,
        numCandsPerBlk8x16: u32,
        numCandsPerBlk8x8: u32,
        numCandsPerSb: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let numCandsPerBlk16x16: u32 = unsafe { ::std::mem::transmute(numCandsPerBlk16x16) };
            numCandsPerBlk16x16 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let numCandsPerBlk16x8: u32 = unsafe { ::std::mem::transmute(numCandsPerBlk16x8) };
            numCandsPerBlk16x8 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let numCandsPerBlk8x16: u32 = unsafe { ::std::mem::transmute(numCandsPerBlk8x16) };
            numCandsPerBlk8x16 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let numCandsPerBlk8x8: u32 = unsafe { ::std::mem::transmute(numCandsPerBlk8x8) };
            numCandsPerBlk8x8 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let numCandsPerSb: u32 = unsafe { ::std::mem::transmute(numCandsPerSb) };
            numCandsPerSb as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE"]
#[doc = " External motion vector hint counts per block type."]
#[doc = " H264 and AV1 support multiple hint while HEVC supports one hint for each valid candidate."]
pub type NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE = _NVENC_EXTERNAL_ME_HINT_COUNTS_PER_BLOCKTYPE;
#[doc = " \\struct _NVENC_EXTERNAL_ME_HINT"]
#[doc = " External Motion Vector hint structure for H264 and HEVC."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NVENC_EXTERNAL_ME_HINT {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout__NVENC_EXTERNAL_ME_HINT() {
    assert_eq!(
        ::std::mem::size_of::<_NVENC_EXTERNAL_ME_HINT>(),
        4usize,
        concat!("Size of: ", stringify!(_NVENC_EXTERNAL_ME_HINT))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVENC_EXTERNAL_ME_HINT>(),
        4usize,
        concat!("Alignment of ", stringify!(_NVENC_EXTERNAL_ME_HINT))
    );
}
impl _NVENC_EXTERNAL_ME_HINT {
    #[inline]
    pub fn mvx(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_mvx(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn mvy(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_mvy(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn refidx(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_refidx(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn dir(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dir(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn partType(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_partType(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn lastofPart(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_lastofPart(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lastOfMB(&self) -> i32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_lastOfMB(&mut self, val: i32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mvx: i32,
        mvy: i32,
        refidx: i32,
        dir: i32,
        partType: i32,
        lastofPart: i32,
        lastOfMB: i32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let mvx: u32 = unsafe { ::std::mem::transmute(mvx) };
            mvx as u64
        });
        __bindgen_bitfield_unit.set(12usize, 10u8, {
            let mvy: u32 = unsafe { ::std::mem::transmute(mvy) };
            mvy as u64
        });
        __bindgen_bitfield_unit.set(22usize, 5u8, {
            let refidx: u32 = unsafe { ::std::mem::transmute(refidx) };
            refidx as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let dir: u32 = unsafe { ::std::mem::transmute(dir) };
            dir as u64
        });
        __bindgen_bitfield_unit.set(28usize, 2u8, {
            let partType: u32 = unsafe { ::std::mem::transmute(partType) };
            partType as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let lastofPart: u32 = unsafe { ::std::mem::transmute(lastofPart) };
            lastofPart as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let lastOfMB: u32 = unsafe { ::std::mem::transmute(lastOfMB) };
            lastOfMB as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NVENC_EXTERNAL_ME_HINT"]
#[doc = " External Motion Vector hint structure for H264 and HEVC."]
pub type NVENC_EXTERNAL_ME_HINT = _NVENC_EXTERNAL_ME_HINT;
#[doc = " \\struct _NVENC_EXTERNAL_ME_SB_HINT"]
#[doc = " External Motion Vector SB hint structure for AV1"]
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NVENC_EXTERNAL_ME_SB_HINT {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
}
#[test]
fn bindgen_test_layout__NVENC_EXTERNAL_ME_SB_HINT() {
    assert_eq!(
        ::std::mem::size_of::<_NVENC_EXTERNAL_ME_SB_HINT>(),
        6usize,
        concat!("Size of: ", stringify!(_NVENC_EXTERNAL_ME_SB_HINT))
    );
    assert_eq!(
        ::std::mem::align_of::<_NVENC_EXTERNAL_ME_SB_HINT>(),
        2usize,
        concat!("Alignment of ", stringify!(_NVENC_EXTERNAL_ME_SB_HINT))
    );
}
impl _NVENC_EXTERNAL_ME_SB_HINT {
    #[inline]
    pub fn refidx(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_refidx(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn direction(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_direction(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bi(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bi(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn partition_type(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_partition_type(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn x8(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_x8(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn last_of_cu(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_last_of_cu(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn last_of_sb(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_last_of_sb(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved0(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_reserved0(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mvx(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 14u8) as u16) }
    }
    #[inline]
    pub fn set_mvx(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn cu_size(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_cu_size(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn mvy(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_mvy(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn y8(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(44usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_y8(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(44usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> i16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: i16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        refidx: i16,
        direction: i16,
        bi: i16,
        partition_type: i16,
        x8: i16,
        last_of_cu: i16,
        last_of_sb: i16,
        reserved0: i16,
        mvx: i16,
        cu_size: i16,
        mvy: i16,
        y8: i16,
        reserved1: i16,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let refidx: u16 = unsafe { ::std::mem::transmute(refidx) };
            refidx as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let direction: u16 = unsafe { ::std::mem::transmute(direction) };
            direction as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bi: u16 = unsafe { ::std::mem::transmute(bi) };
            bi as u64
        });
        __bindgen_bitfield_unit.set(7usize, 3u8, {
            let partition_type: u16 = unsafe { ::std::mem::transmute(partition_type) };
            partition_type as u64
        });
        __bindgen_bitfield_unit.set(10usize, 3u8, {
            let x8: u16 = unsafe { ::std::mem::transmute(x8) };
            x8 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let last_of_cu: u16 = unsafe { ::std::mem::transmute(last_of_cu) };
            last_of_cu as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let last_of_sb: u16 = unsafe { ::std::mem::transmute(last_of_sb) };
            last_of_sb as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let reserved0: u16 = unsafe { ::std::mem::transmute(reserved0) };
            reserved0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 14u8, {
            let mvx: u16 = unsafe { ::std::mem::transmute(mvx) };
            mvx as u64
        });
        __bindgen_bitfield_unit.set(30usize, 2u8, {
            let cu_size: u16 = unsafe { ::std::mem::transmute(cu_size) };
            cu_size as u64
        });
        __bindgen_bitfield_unit.set(32usize, 12u8, {
            let mvy: u16 = unsafe { ::std::mem::transmute(mvy) };
            mvy as u64
        });
        __bindgen_bitfield_unit.set(44usize, 3u8, {
            let y8: u16 = unsafe { ::std::mem::transmute(y8) };
            y8 as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let reserved1: u16 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NVENC_EXTERNAL_ME_SB_HINT"]
#[doc = " External Motion Vector SB hint structure for AV1"]
pub type NVENC_EXTERNAL_ME_SB_HINT = _NVENC_EXTERNAL_ME_SB_HINT;
#[doc = " \\struct _NV_ENC_CONFIG_H264"]
#[doc = " H264 encoder configuration parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_H264 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Specifies the encoding level. Client is recommended to set this to NV_ENC_LEVEL_AUTOSELECT in order to enable the NvEncodeAPI interface to select the correct level."]
    pub level: u32,
    #[doc = "< [in]: Specifies the IDR interval. If not set, this is made equal to gopLength in NV_ENC_CONFIG.Low latency application client can set IDR interval to NVENC_INFINITE_GOPLENGTH so that IDR frames are not inserted automatically."]
    pub idrPeriod: u32,
    #[doc = "< [in]: Set to 1 to enable 4:4:4 separate colour planes"]
    pub separateColourPlaneFlag: u32,
    #[doc = "< [in]: Specifies the deblocking filter mode. Permissible value range: [0,2]. This flag corresponds"]
    #[doc = "to the flag disable_deblocking_filter_idc specified in section 7.4.3 of H.264 specification,"]
    #[doc = "which specifies whether the operation of the deblocking filter shall be disabled across some"]
    #[doc = "block edges of the slice and specifies for which edges the filtering is disabled. See section"]
    #[doc = "7.4.3 of H.264 specification for more details."]
    pub disableDeblockingFilterIDC: u32,
    #[doc = "< [in]: Specifies number of temporal layers to be used for hierarchical coding / temporal SVC. Valid value range is [1,::NV_ENC_CAPS_NUM_MAX_TEMPORAL_LAYERS]"]
    pub numTemporalLayers: u32,
    #[doc = "< [in]: Specifies the SPS id of the sequence header"]
    pub spsId: u32,
    #[doc = "< [in]: Specifies the PPS id of the picture header"]
    pub ppsId: u32,
    #[doc = "< [in]: Specifies the AdaptiveTransform Mode. Check support for AdaptiveTransform mode using ::NV_ENC_CAPS_SUPPORT_ADAPTIVE_TRANSFORM caps."]
    pub adaptiveTransformMode: NV_ENC_H264_ADAPTIVE_TRANSFORM_MODE,
    #[doc = "< [in]: Specified the FMO Mode. Check support for FMO using ::NV_ENC_CAPS_SUPPORT_FMO caps."]
    pub fmoMode: NV_ENC_H264_FMO_MODE,
    #[doc = "< [in]: Specifies the BDirect mode. Check support for BDirect mode using ::NV_ENC_CAPS_SUPPORT_BDIRECT_MODE caps."]
    pub bdirectMode: NV_ENC_H264_BDIRECT_MODE,
    #[doc = "< [in]: Specifies the entropy coding mode. Check support for CABAC mode using ::NV_ENC_CAPS_SUPPORT_CABAC caps."]
    pub entropyCodingMode: NV_ENC_H264_ENTROPY_CODING_MODE,
    #[doc = "< [in]: Specifies the stereo frame packing mode which is to be signaled in frame packing arrangement SEI"]
    pub stereoMode: NV_ENC_STEREO_PACKING_MODE,
    #[doc = "< [in]: Specifies the interval between successive intra refresh if enableIntrarefresh is set. Requires enableIntraRefresh to be set."]
    #[doc = "Will be disabled if NV_ENC_CONFIG::gopLength is not set to NVENC_INFINITE_GOPLENGTH."]
    pub intraRefreshPeriod: u32,
    #[doc = "< [in]: Specifies the length of intra refresh in number of frames for periodic intra refresh. This value should be smaller than intraRefreshPeriod"]
    pub intraRefreshCnt: u32,
    #[doc = "< [in]: Specifies the DPB size used for encoding. Setting it to 0 will let driver use the default DPB size."]
    #[doc = "The low latency application which wants to invalidate reference frame as an error resilience tool"]
    #[doc = "is recommended to use a large DPB size so that the encoder can keep old reference frames which can be used if recent"]
    #[doc = "frames are invalidated."]
    pub maxNumRefFrames: u32,
    #[doc = "< [in]: This parameter in conjunction with sliceModeData specifies the way in which the picture is divided into slices"]
    #[doc = "sliceMode = 0 MB based slices, sliceMode = 1 Byte based slices, sliceMode = 2 MB row based slices, sliceMode = 3 numSlices in Picture."]
    #[doc = "When forceIntraRefreshWithFrameCnt is set it will have priority over sliceMode setting"]
    #[doc = "When sliceMode == 0 and sliceModeData == 0 whole picture will be coded with one slice"]
    pub sliceMode: u32,
    #[doc = "< [in]: Specifies the parameter needed for sliceMode. For:"]
    #[doc = "sliceMode = 0, sliceModeData specifies # of MBs in each slice (except last slice)"]
    #[doc = "sliceMode = 1, sliceModeData specifies maximum # of bytes in each slice (except last slice)"]
    #[doc = "sliceMode = 2, sliceModeData specifies # of MB rows in each slice (except last slice)"]
    #[doc = "sliceMode = 3, sliceModeData specifies number of slices in the picture. Driver will divide picture into slices optimally"]
    pub sliceModeData: u32,
    #[doc = "< [in]: Specifies the H264 video usability info parameters"]
    pub h264VUIParameters: NV_ENC_CONFIG_H264_VUI_PARAMETERS,
    #[doc = "< [in]: Specifies the number of LTR frames. This parameter has different meaning in two LTR modes."]
    #[doc = "In \"LTR Trust\" mode (ltrTrustMode = 1), encoder will mark the first ltrNumFrames base layer reference frames within each IDR interval as LTR."]
    #[doc = "In \"LTR Per Picture\" mode (ltrTrustMode = 0 and ltrMarkFrame = 1), ltrNumFrames specifies maximum number of LTR frames in DPB."]
    pub ltrNumFrames: u32,
    #[doc = "< [in]: Specifies the LTR operating mode. See comments near NV_ENC_CONFIG_H264::enableLTR for description of the two modes."]
    #[doc = "Set to 1 to use \"LTR Trust\" mode of LTR operation. Clients are discouraged to use \"LTR Trust\" mode as this mode may"]
    #[doc = "be deprecated in future releases."]
    #[doc = "Set to 0 when using \"LTR Per Picture\" mode of LTR operation."]
    pub ltrTrustMode: u32,
    #[doc = "< [in]: Specifies the chroma format. Should be set to 1 for yuv420 input, 3 for yuv444 input."]
    #[doc = "Check support for YUV444 encoding using ::NV_ENC_CAPS_SUPPORT_YUV444_ENCODE caps."]
    pub chromaFormatIDC: u32,
    #[doc = "< [in]: Specifies the max temporal layer used for temporal SVC / hierarchical coding."]
    #[doc = "Defaut value of this field is NV_ENC_CAPS::NV_ENC_CAPS_NUM_MAX_TEMPORAL_LAYERS. Note that the value NV_ENC_CONFIG_H264::maxNumRefFrames should"]
    #[doc = "be greater than or equal to (NV_ENC_CONFIG_H264::maxTemporalLayers - 2) * 2, for NV_ENC_CONFIG_H264::maxTemporalLayers >= 2."]
    pub maxTemporalLayers: u32,
    #[doc = "< [in]: Specifies the B-Frame as reference mode. Check support for useBFramesAsRef mode using ::NV_ENC_CAPS_SUPPORT_BFRAME_REF_MODE caps."]
    pub useBFramesAsRef: NV_ENC_BFRAME_REF_MODE,
    #[doc = "< [in]: Specifies max number of reference frames in reference picture list L0, that can be used by hardware for prediction of a frame."]
    #[doc = "Check support for numRefL0 using ::NV_ENC_CAPS_SUPPORT_MULTIPLE_REF_FRAMES caps."]
    pub numRefL0: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies max number of reference frames in reference picture list L1, that can be used by hardware for prediction of a frame."]
    #[doc = "Check support for numRefL1 using ::NV_ENC_CAPS_SUPPORT_MULTIPLE_REF_FRAMES caps."]
    pub numRefL1: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies pixel bit depth of encoded video. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit, NV_ENC_BIT_DEPTH_10 for 10 bit."]
    pub outputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: Specifies pixel bit depth of video input. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit input, NV_ENC_BIT_DEPTH_10 for 10 bit input."]
    pub inputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: Specifies the strength of temporal filtering. Check support for temporal filter using ::NV_ENC_CAPS_SUPPORT_TEMPORAL_FILTER caps."]
    #[doc = "Temporal filter feature is supported only if frameIntervalP >= 5."]
    #[doc = "If ZeroReorderDelay or enableStereoMVC is enabled, the temporal filter feature is not supported."]
    #[doc = "Temporal filter is recommended for natural contents."]
    pub tfLevel: NV_ENC_TEMPORAL_FILTER_LEVEL,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 264usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_H264() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_H264>(),
        1792usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_H264))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_H264>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CONFIG_H264))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).level as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).idrPeriod as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(idrPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).separateColourPlaneFlag as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(separateColourPlaneFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).disableDeblockingFilterIDC as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(disableDeblockingFilterIDC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).numTemporalLayers as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(numTemporalLayers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).spsId as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(spsId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).ppsId as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(ppsId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).adaptiveTransformMode as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(adaptiveTransformMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).fmoMode as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(fmoMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).bdirectMode as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(bdirectMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).entropyCodingMode as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(entropyCodingMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).stereoMode as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(stereoMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).intraRefreshPeriod as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(intraRefreshPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).intraRefreshCnt as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(intraRefreshCnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).maxNumRefFrames as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(maxNumRefFrames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).sliceMode as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(sliceMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).sliceModeData as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(sliceModeData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).h264VUIParameters as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(h264VUIParameters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).ltrNumFrames as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(ltrNumFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).ltrTrustMode as *const _ as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(ltrTrustMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).chromaFormatIDC as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(chromaFormatIDC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).maxTemporalLayers as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(maxTemporalLayers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).useBFramesAsRef as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(useBFramesAsRef)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).numRefL0 as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(numRefL0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).numRefL1 as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(numRefL1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).outputBitDepth as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(outputBitDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).inputBitDepth as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(inputBitDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).tfLevel as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(tfLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).reserved1 as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264>())).reserved2 as *const _ as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CONFIG_H264 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_ENC_CONFIG_H264 {
    #[inline]
    pub fn enableTemporalSVC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTemporalSVC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableStereoMVC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableStereoMVC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hierarchicalPFrames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hierarchicalPFrames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn hierarchicalBFrames(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_hierarchicalBFrames(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputBufferingPeriodSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputBufferingPeriodSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputPictureTimingSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputPictureTimingSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputAUD(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputAUD(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableSPSPPS(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableSPSPPS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputFramePackingSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputFramePackingSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputRecoveryPointSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputRecoveryPointSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableIntraRefresh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableIntraRefresh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableConstrainedEncoding(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableConstrainedEncoding(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn repeatSPSPPS(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_repeatSPSPPS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableVFR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableVFR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableLTR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableLTR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn qpPrimeYZeroTransformBypassFlag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_qpPrimeYZeroTransformBypassFlag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn useConstrainedIntraPred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_useConstrainedIntraPred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableFillerDataInsertion(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableFillerDataInsertion(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableSVCPrefixNalu(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableSVCPrefixNalu(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableScalabilityInfoSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableScalabilityInfoSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn singleSliceIntraRefresh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_singleSliceIntraRefresh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableTimeCode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTimeCode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservedBitFields(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_reservedBitFields(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        enableTemporalSVC: u32,
        enableStereoMVC: u32,
        hierarchicalPFrames: u32,
        hierarchicalBFrames: u32,
        outputBufferingPeriodSEI: u32,
        outputPictureTimingSEI: u32,
        outputAUD: u32,
        disableSPSPPS: u32,
        outputFramePackingSEI: u32,
        outputRecoveryPointSEI: u32,
        enableIntraRefresh: u32,
        enableConstrainedEncoding: u32,
        repeatSPSPPS: u32,
        enableVFR: u32,
        enableLTR: u32,
        qpPrimeYZeroTransformBypassFlag: u32,
        useConstrainedIntraPred: u32,
        enableFillerDataInsertion: u32,
        disableSVCPrefixNalu: u32,
        enableScalabilityInfoSEI: u32,
        singleSliceIntraRefresh: u32,
        enableTimeCode: u32,
        reservedBitFields: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enableTemporalSVC: u32 = unsafe { ::std::mem::transmute(enableTemporalSVC) };
            enableTemporalSVC as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enableStereoMVC: u32 = unsafe { ::std::mem::transmute(enableStereoMVC) };
            enableStereoMVC as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let hierarchicalPFrames: u32 = unsafe { ::std::mem::transmute(hierarchicalPFrames) };
            hierarchicalPFrames as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let hierarchicalBFrames: u32 = unsafe { ::std::mem::transmute(hierarchicalBFrames) };
            hierarchicalBFrames as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let outputBufferingPeriodSEI: u32 =
                unsafe { ::std::mem::transmute(outputBufferingPeriodSEI) };
            outputBufferingPeriodSEI as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let outputPictureTimingSEI: u32 =
                unsafe { ::std::mem::transmute(outputPictureTimingSEI) };
            outputPictureTimingSEI as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let outputAUD: u32 = unsafe { ::std::mem::transmute(outputAUD) };
            outputAUD as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let disableSPSPPS: u32 = unsafe { ::std::mem::transmute(disableSPSPPS) };
            disableSPSPPS as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let outputFramePackingSEI: u32 =
                unsafe { ::std::mem::transmute(outputFramePackingSEI) };
            outputFramePackingSEI as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let outputRecoveryPointSEI: u32 =
                unsafe { ::std::mem::transmute(outputRecoveryPointSEI) };
            outputRecoveryPointSEI as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let enableIntraRefresh: u32 = unsafe { ::std::mem::transmute(enableIntraRefresh) };
            enableIntraRefresh as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let enableConstrainedEncoding: u32 =
                unsafe { ::std::mem::transmute(enableConstrainedEncoding) };
            enableConstrainedEncoding as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let repeatSPSPPS: u32 = unsafe { ::std::mem::transmute(repeatSPSPPS) };
            repeatSPSPPS as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let enableVFR: u32 = unsafe { ::std::mem::transmute(enableVFR) };
            enableVFR as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let enableLTR: u32 = unsafe { ::std::mem::transmute(enableLTR) };
            enableLTR as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let qpPrimeYZeroTransformBypassFlag: u32 =
                unsafe { ::std::mem::transmute(qpPrimeYZeroTransformBypassFlag) };
            qpPrimeYZeroTransformBypassFlag as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let useConstrainedIntraPred: u32 =
                unsafe { ::std::mem::transmute(useConstrainedIntraPred) };
            useConstrainedIntraPred as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let enableFillerDataInsertion: u32 =
                unsafe { ::std::mem::transmute(enableFillerDataInsertion) };
            enableFillerDataInsertion as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let disableSVCPrefixNalu: u32 = unsafe { ::std::mem::transmute(disableSVCPrefixNalu) };
            disableSVCPrefixNalu as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let enableScalabilityInfoSEI: u32 =
                unsafe { ::std::mem::transmute(enableScalabilityInfoSEI) };
            enableScalabilityInfoSEI as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let singleSliceIntraRefresh: u32 =
                unsafe { ::std::mem::transmute(singleSliceIntraRefresh) };
            singleSliceIntraRefresh as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let enableTimeCode: u32 = unsafe { ::std::mem::transmute(enableTimeCode) };
            enableTimeCode as u64
        });
        __bindgen_bitfield_unit.set(22usize, 10u8, {
            let reservedBitFields: u32 = unsafe { ::std::mem::transmute(reservedBitFields) };
            reservedBitFields as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_H264"]
#[doc = " H264 encoder configuration parameters"]
pub type NV_ENC_CONFIG_H264 = _NV_ENC_CONFIG_H264;
#[doc = " \\struct _NV_ENC_CONFIG_HEVC"]
#[doc = " HEVC encoder configuration parameters to be set during initialization."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_HEVC {
    #[doc = "< [in]: Specifies the level of the encoded bitstream."]
    pub level: u32,
    #[doc = "< [in]: Specifies the level tier of the encoded bitstream."]
    pub tier: u32,
    #[doc = "< [in]: Specifies the minimum size of luma coding unit."]
    pub minCUSize: NV_ENC_HEVC_CUSIZE,
    #[doc = "< [in]: Specifies the maximum size of luma coding unit. Currently NVENC SDK only supports maxCUSize equal to NV_ENC_HEVC_CUSIZE_32x32."]
    pub maxCUSize: NV_ENC_HEVC_CUSIZE,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Specifies the IDR interval. If not set, this is made equal to gopLength in NV_ENC_CONFIG. Low latency application client can set IDR interval to NVENC_INFINITE_GOPLENGTH so that IDR frames are not inserted automatically."]
    pub idrPeriod: u32,
    #[doc = "< [in]: Specifies the interval between successive intra refresh if enableIntrarefresh is set. Requires enableIntraRefresh to be set."]
    #[doc = "Will be disabled if NV_ENC_CONFIG::gopLength is not set to NVENC_INFINITE_GOPLENGTH."]
    pub intraRefreshPeriod: u32,
    #[doc = "< [in]: Specifies the length of intra refresh in number of frames for periodic intra refresh. This value should be smaller than intraRefreshPeriod"]
    pub intraRefreshCnt: u32,
    #[doc = "< [in]: Specifies the maximum number of references frames in the DPB."]
    pub maxNumRefFramesInDPB: u32,
    #[doc = "< [in]: This parameter has different meaning in two LTR modes."]
    #[doc = "In \"LTR Trust\" mode (ltrTrustMode = 1), encoder will mark the first ltrNumFrames base layer reference frames within each IDR interval as LTR."]
    #[doc = "In \"LTR Per Picture\" mode (ltrTrustMode = 0 and ltrMarkFrame = 1), ltrNumFrames specifies maximum number of LTR frames in DPB."]
    #[doc = "These ltrNumFrames acts as a guidance to the encoder and are not necessarily honored. To achieve a right balance between the encoding"]
    #[doc = "quality and keeping LTR frames in the DPB queue, the encoder can internally limit the number of LTR frames."]
    #[doc = "The number of LTR frames actually used depends upon the encoding preset being used; Faster encoding presets will use fewer LTR frames."]
    pub ltrNumFrames: u32,
    #[doc = "< [in]: Specifies the VPS id of the video parameter set"]
    pub vpsId: u32,
    #[doc = "< [in]: Specifies the SPS id of the sequence header"]
    pub spsId: u32,
    #[doc = "< [in]: Specifies the PPS id of the picture header"]
    pub ppsId: u32,
    #[doc = "< [in]: This parameter in conjunction with sliceModeData specifies the way in which the picture is divided into slices"]
    #[doc = "sliceMode = 0 CTU based slices, sliceMode = 1 Byte based slices, sliceMode = 2 CTU row based slices, sliceMode = 3, numSlices in Picture"]
    #[doc = "When sliceMode == 0 and sliceModeData == 0 whole picture will be coded with one slice"]
    pub sliceMode: u32,
    #[doc = "< [in]: Specifies the parameter needed for sliceMode. For:"]
    #[doc = "sliceMode = 0, sliceModeData specifies # of CTUs in each slice (except last slice)"]
    #[doc = "sliceMode = 1, sliceModeData specifies maximum # of bytes in each slice (except last slice)"]
    #[doc = "sliceMode = 2, sliceModeData specifies # of CTU rows in each slice (except last slice)"]
    #[doc = "sliceMode = 3, sliceModeData specifies number of slices in the picture. Driver will divide picture into slices optimally"]
    pub sliceModeData: u32,
    #[doc = "< [in]: Specifies the max temporal layer used for hierarchical coding."]
    pub maxTemporalLayersMinus1: u32,
    #[doc = "< [in]: Specifies the HEVC video usability info parameters"]
    pub hevcVUIParameters: NV_ENC_CONFIG_HEVC_VUI_PARAMETERS,
    #[doc = "< [in]: Specifies the LTR operating mode. See comments near NV_ENC_CONFIG_HEVC::enableLTR for description of the two modes."]
    #[doc = "Set to 1 to use \"LTR Trust\" mode of LTR operation. Clients are discouraged to use \"LTR Trust\" mode as this mode may"]
    #[doc = "be deprecated in future releases."]
    #[doc = "Set to 0 when using \"LTR Per Picture\" mode of LTR operation."]
    pub ltrTrustMode: u32,
    #[doc = "< [in]: Specifies the B-Frame as reference mode. Check support for useBFramesAsRef mode using  ::NV_ENC_CAPS_SUPPORT_BFRAME_REF_MODE caps."]
    pub useBFramesAsRef: NV_ENC_BFRAME_REF_MODE,
    #[doc = "< [in]: Specifies max number of reference frames in reference picture list L0, that can be used by hardware for prediction of a frame."]
    #[doc = "Check support for numRefL0 using ::NV_ENC_CAPS_SUPPORT_MULTIPLE_REF_FRAMES caps."]
    pub numRefL0: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies max number of reference frames in reference picture list L1, that can be used by hardware for prediction of a frame."]
    #[doc = "Check support for numRefL1 using ::NV_ENC_CAPS_SUPPORT_MULTIPLE_REF_FRAMES caps."]
    pub numRefL1: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies the strength of the temporal filtering. Check support for temporal filtering using ::NV_ENC_CAPS_SUPPORT_TEMPORAL_FILTER caps."]
    #[doc = "Temporal filter feature is supported only if frameIntervalP >= 5."]
    #[doc = "Temporal filter feature is not supported with ZeroReorderDelay/enableStereoMVC/AlphaLayerEncoding."]
    #[doc = "Temporal filter is recommended for natural contents."]
    pub tfLevel: NV_ENC_TEMPORAL_FILTER_LEVEL,
    #[doc = "< [in]: Specifies the deblocking filter mode. Permissible value range: [0,2]. This flag corresponds"]
    #[doc = "to the flag pps_deblocking_filter_disabled_flag specified in section 7.4.3.3 of H.265 specification,"]
    #[doc = "which specifies whether the operation of the deblocking filter shall be disabled across some"]
    #[doc = "block edges of the slice and specifies for which edges the filtering is disabled. See section"]
    #[doc = "7.4.3.3 of H.265 specification for more details."]
    pub disableDeblockingFilterIDC: u32,
    #[doc = "< [in]: Specifies pixel bit depth of encoded video. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit, NV_ENC_BIT_DEPTH_10 for 10 bit."]
    #[doc = "SW will do the bitdepth conversion internally from inputBitDepth -> outputBitDepth if bit depths differ"]
    #[doc = "Support for 8 bit input to 10 bit encode conversion only"]
    pub outputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: Specifies pixel bit depth of video input. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit input, NV_ENC_BIT_DEPTH_10 for 10 bit input."]
    pub inputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: Specifies the number of temporal layers to be used for hierarchical coding."]
    pub numTemporalLayers: u32,
    #[doc = "< [in]: Specifies number of views for MVHEVC"]
    pub numViews: u32,
    #[doc = "< [in]: Reserved and must be set to 0."]
    pub reserved1: [u32; 208usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_HEVC() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_HEVC>(),
        1560usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_HEVC))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_HEVC>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CONFIG_HEVC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).level as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).tier as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(tier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).minCUSize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(minCUSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).maxCUSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(maxCUSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).idrPeriod as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(idrPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).intraRefreshPeriod as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(intraRefreshPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).intraRefreshCnt as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(intraRefreshCnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).maxNumRefFramesInDPB as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(maxNumRefFramesInDPB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).ltrNumFrames as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(ltrNumFrames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).vpsId as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(vpsId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).spsId as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(spsId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).ppsId as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(ppsId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).sliceMode as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(sliceMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).sliceModeData as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(sliceModeData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).maxTemporalLayersMinus1 as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(maxTemporalLayersMinus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).hevcVUIParameters as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(hevcVUIParameters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).ltrTrustMode as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(ltrTrustMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).useBFramesAsRef as *const _ as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(useBFramesAsRef)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).numRefL0 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(numRefL0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).numRefL1 as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(numRefL1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).tfLevel as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(tfLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).disableDeblockingFilterIDC as *const _
                as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(disableDeblockingFilterIDC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).outputBitDepth as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(outputBitDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).inputBitDepth as *const _ as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(inputBitDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).numTemporalLayers as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(numTemporalLayers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).numViews as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(numViews)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).reserved1 as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC>())).reserved2 as *const _ as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CONFIG_HEVC {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_ENC_CONFIG_HEVC {
    #[inline]
    pub fn useConstrainedIntraPred(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_useConstrainedIntraPred(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableDeblockAcrossSliceBoundary(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableDeblockAcrossSliceBoundary(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputBufferingPeriodSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputBufferingPeriodSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputPictureTimingSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputPictureTimingSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputAUD(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputAUD(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableLTR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableLTR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableSPSPPS(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableSPSPPS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn repeatSPSPPS(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_repeatSPSPPS(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableIntraRefresh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableIntraRefresh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chromaFormatIDC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_chromaFormatIDC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved3(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_reserved3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn enableFillerDataInsertion(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableFillerDataInsertion(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableConstrainedEncoding(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableConstrainedEncoding(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableAlphaLayerEncoding(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableAlphaLayerEncoding(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn singleSliceIntraRefresh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_singleSliceIntraRefresh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputRecoveryPointSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputRecoveryPointSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputTimeCodeSEI(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputTimeCodeSEI(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableTemporalSVC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTemporalSVC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableMVHEVC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableMVHEVC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputHevc3DReferenceDisplayInfo(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputHevc3DReferenceDisplayInfo(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputMaxCll(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputMaxCll(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputMasteringDisplay(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputMasteringDisplay(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(25usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(25usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        useConstrainedIntraPred: u32,
        disableDeblockAcrossSliceBoundary: u32,
        outputBufferingPeriodSEI: u32,
        outputPictureTimingSEI: u32,
        outputAUD: u32,
        enableLTR: u32,
        disableSPSPPS: u32,
        repeatSPSPPS: u32,
        enableIntraRefresh: u32,
        chromaFormatIDC: u32,
        reserved3: u32,
        enableFillerDataInsertion: u32,
        enableConstrainedEncoding: u32,
        enableAlphaLayerEncoding: u32,
        singleSliceIntraRefresh: u32,
        outputRecoveryPointSEI: u32,
        outputTimeCodeSEI: u32,
        enableTemporalSVC: u32,
        enableMVHEVC: u32,
        outputHevc3DReferenceDisplayInfo: u32,
        outputMaxCll: u32,
        outputMasteringDisplay: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let useConstrainedIntraPred: u32 =
                unsafe { ::std::mem::transmute(useConstrainedIntraPred) };
            useConstrainedIntraPred as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let disableDeblockAcrossSliceBoundary: u32 =
                unsafe { ::std::mem::transmute(disableDeblockAcrossSliceBoundary) };
            disableDeblockAcrossSliceBoundary as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let outputBufferingPeriodSEI: u32 =
                unsafe { ::std::mem::transmute(outputBufferingPeriodSEI) };
            outputBufferingPeriodSEI as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let outputPictureTimingSEI: u32 =
                unsafe { ::std::mem::transmute(outputPictureTimingSEI) };
            outputPictureTimingSEI as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let outputAUD: u32 = unsafe { ::std::mem::transmute(outputAUD) };
            outputAUD as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let enableLTR: u32 = unsafe { ::std::mem::transmute(enableLTR) };
            enableLTR as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let disableSPSPPS: u32 = unsafe { ::std::mem::transmute(disableSPSPPS) };
            disableSPSPPS as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let repeatSPSPPS: u32 = unsafe { ::std::mem::transmute(repeatSPSPPS) };
            repeatSPSPPS as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let enableIntraRefresh: u32 = unsafe { ::std::mem::transmute(enableIntraRefresh) };
            enableIntraRefresh as u64
        });
        __bindgen_bitfield_unit.set(9usize, 2u8, {
            let chromaFormatIDC: u32 = unsafe { ::std::mem::transmute(chromaFormatIDC) };
            chromaFormatIDC as u64
        });
        __bindgen_bitfield_unit.set(11usize, 3u8, {
            let reserved3: u32 = unsafe { ::std::mem::transmute(reserved3) };
            reserved3 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let enableFillerDataInsertion: u32 =
                unsafe { ::std::mem::transmute(enableFillerDataInsertion) };
            enableFillerDataInsertion as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let enableConstrainedEncoding: u32 =
                unsafe { ::std::mem::transmute(enableConstrainedEncoding) };
            enableConstrainedEncoding as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let enableAlphaLayerEncoding: u32 =
                unsafe { ::std::mem::transmute(enableAlphaLayerEncoding) };
            enableAlphaLayerEncoding as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let singleSliceIntraRefresh: u32 =
                unsafe { ::std::mem::transmute(singleSliceIntraRefresh) };
            singleSliceIntraRefresh as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let outputRecoveryPointSEI: u32 =
                unsafe { ::std::mem::transmute(outputRecoveryPointSEI) };
            outputRecoveryPointSEI as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let outputTimeCodeSEI: u32 = unsafe { ::std::mem::transmute(outputTimeCodeSEI) };
            outputTimeCodeSEI as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let enableTemporalSVC: u32 = unsafe { ::std::mem::transmute(enableTemporalSVC) };
            enableTemporalSVC as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let enableMVHEVC: u32 = unsafe { ::std::mem::transmute(enableMVHEVC) };
            enableMVHEVC as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let outputHevc3DReferenceDisplayInfo: u32 =
                unsafe { ::std::mem::transmute(outputHevc3DReferenceDisplayInfo) };
            outputHevc3DReferenceDisplayInfo as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let outputMaxCll: u32 = unsafe { ::std::mem::transmute(outputMaxCll) };
            outputMaxCll as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let outputMasteringDisplay: u32 =
                unsafe { ::std::mem::transmute(outputMasteringDisplay) };
            outputMasteringDisplay as u64
        });
        __bindgen_bitfield_unit.set(25usize, 7u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_HEVC"]
#[doc = " HEVC encoder configuration parameters to be set during initialization."]
pub type NV_ENC_CONFIG_HEVC = _NV_ENC_CONFIG_HEVC;
#[doc = " \\struct _NV_ENC_FILM_GRAIN_PARAMS_AV1"]
#[doc = " AV1 Film Grain Parameters structure"]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_FILM_GRAIN_PARAMS_AV1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: pointYValue[i]: x coordinate for i-th point of luma piecewise linear scaling function. Values on a scale of 0...255"]
    pub pointYValue: [u8; 14usize],
    #[doc = "< [in]: pointYScaling[i]: i-th point output value of luma piecewise linear scaling function"]
    pub pointYScaling: [u8; 14usize],
    #[doc = "< [in]: pointCbValue[i]: x coordinate for i-th point of cb piecewise linear scaling function. Values on a scale of 0...255"]
    pub pointCbValue: [u8; 10usize],
    #[doc = "< [in]: pointCbScaling[i]: i-th point output value of cb piecewise linear scaling function"]
    pub pointCbScaling: [u8; 10usize],
    #[doc = "< [in]: pointCrValue[i]: x coordinate for i-th point of cr piecewise linear scaling function. Values on a scale of 0...255"]
    pub pointCrValue: [u8; 10usize],
    #[doc = "< [in]: pointCrScaling[i]: i-th point output value of cr piecewise linear scaling function"]
    pub pointCrScaling: [u8; 10usize],
    #[doc = "< [in]: Specifies auto-regressive coefficients used for the Y plane"]
    pub arCoeffsYPlus128: [u8; 24usize],
    #[doc = "< [in]: Specifies auto-regressive coefficients used for the U plane"]
    pub arCoeffsCbPlus128: [u8; 25usize],
    #[doc = "< [in]: Specifies auto-regressive coefficients used for the V plane"]
    pub arCoeffsCrPlus128: [u8; 25usize],
    #[doc = "< [in]: Reserved bytes -  should be set to 0"]
    pub reserved2: [u8; 2usize],
    #[doc = "< [in]: Represents a multiplier for the cb component used in derivation of the input index to the cb component scaling function"]
    pub cbMult: u8,
    #[doc = "< [in]: represents a multiplier for the average luma component used in derivation of the input index to the cb component scaling function."]
    pub cbLumaMult: u8,
    #[doc = "< [in]: Represents an offset used in derivation of the input index to the cb component scaling function"]
    pub cbOffset: u16,
    #[doc = "< [in]: Represents a multiplier for the cr component used in derivation of the input index to the cr component scaling function"]
    pub crMult: u8,
    #[doc = "< [in]: represents a multiplier for the average luma component used in derivation of the input index to the cr component scaling function."]
    pub crLumaMult: u8,
    #[doc = "< [in]: Represents an offset used in derivation of the input index to the cr component scaling function"]
    pub crOffset: u16,
}
#[test]
fn bindgen_test_layout__NV_ENC_FILM_GRAIN_PARAMS_AV1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>(),
        156usize,
        concat!("Size of: ", stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>(),
        4usize,
        concat!("Alignment of ", stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointYValue as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointYValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointYScaling as *const _
                as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointYScaling)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointCbValue as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointCbValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointCbScaling as *const _
                as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointCbScaling)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointCrValue as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointCrValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).pointCrScaling as *const _
                as usize
        },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(pointCrScaling)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).arCoeffsYPlus128 as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(arCoeffsYPlus128)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).arCoeffsCbPlus128 as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(arCoeffsCbPlus128)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).arCoeffsCrPlus128 as *const _
                as usize
        },
        121usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(arCoeffsCrPlus128)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).reserved2 as *const _ as usize
        },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).cbMult as *const _ as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(cbMult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).cbLumaMult as *const _
                as usize
        },
        149usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(cbLumaMult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).cbOffset as *const _ as usize
        },
        150usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(cbOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).crMult as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(crMult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).crLumaMult as *const _
                as usize
        },
        153usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(crLumaMult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_FILM_GRAIN_PARAMS_AV1>())).crOffset as *const _ as usize
        },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_FILM_GRAIN_PARAMS_AV1),
            "::",
            stringify!(crOffset)
        )
    );
}
impl _NV_ENC_FILM_GRAIN_PARAMS_AV1 {
    #[inline]
    pub fn applyGrain(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_applyGrain(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chromaScalingFromLuma(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_chromaScalingFromLuma(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overlapFlag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overlapFlag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn clipToRestrictedRange(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_clipToRestrictedRange(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn grainScalingMinus8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_grainScalingMinus8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn arCoeffLag(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_arCoeffLag(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn numYPoints(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numYPoints(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCbPoints(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCbPoints(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn numCrPoints(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_numCrPoints(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn arCoeffShiftMinus6(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_arCoeffShiftMinus6(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn grainScaleShift(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_grainScaleShift(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        applyGrain: u32,
        chromaScalingFromLuma: u32,
        overlapFlag: u32,
        clipToRestrictedRange: u32,
        grainScalingMinus8: u32,
        arCoeffLag: u32,
        numYPoints: u32,
        numCbPoints: u32,
        numCrPoints: u32,
        arCoeffShiftMinus6: u32,
        grainScaleShift: u32,
        reserved1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let applyGrain: u32 = unsafe { ::std::mem::transmute(applyGrain) };
            applyGrain as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let chromaScalingFromLuma: u32 =
                unsafe { ::std::mem::transmute(chromaScalingFromLuma) };
            chromaScalingFromLuma as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let overlapFlag: u32 = unsafe { ::std::mem::transmute(overlapFlag) };
            overlapFlag as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let clipToRestrictedRange: u32 =
                unsafe { ::std::mem::transmute(clipToRestrictedRange) };
            clipToRestrictedRange as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let grainScalingMinus8: u32 = unsafe { ::std::mem::transmute(grainScalingMinus8) };
            grainScalingMinus8 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let arCoeffLag: u32 = unsafe { ::std::mem::transmute(arCoeffLag) };
            arCoeffLag as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let numYPoints: u32 = unsafe { ::std::mem::transmute(numYPoints) };
            numYPoints as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let numCbPoints: u32 = unsafe { ::std::mem::transmute(numCbPoints) };
            numCbPoints as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let numCrPoints: u32 = unsafe { ::std::mem::transmute(numCrPoints) };
            numCrPoints as u64
        });
        __bindgen_bitfield_unit.set(20usize, 2u8, {
            let arCoeffShiftMinus6: u32 = unsafe { ::std::mem::transmute(arCoeffShiftMinus6) };
            arCoeffShiftMinus6 as u64
        });
        __bindgen_bitfield_unit.set(22usize, 2u8, {
            let grainScaleShift: u32 = unsafe { ::std::mem::transmute(grainScaleShift) };
            grainScaleShift as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NV_ENC_FILM_GRAIN_PARAMS_AV1"]
#[doc = " AV1 Film Grain Parameters structure"]
pub type NV_ENC_FILM_GRAIN_PARAMS_AV1 = _NV_ENC_FILM_GRAIN_PARAMS_AV1;
#[doc = " \\struct _NV_ENC_CONFIG_AV1"]
#[doc = " AV1 encoder configuration parameters to be set during initialization."]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_AV1 {
    #[doc = "< [in]: Specifies the level of the encoded bitstream."]
    pub level: u32,
    #[doc = "< [in]: Specifies the level tier of the encoded bitstream."]
    pub tier: u32,
    #[doc = "< [in]: Specifies the minimum size of luma coding block partition."]
    pub minPartSize: NV_ENC_AV1_PART_SIZE,
    #[doc = "< [in]: Specifies the maximum size of luma coding block partition."]
    pub maxPartSize: NV_ENC_AV1_PART_SIZE,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Specifies the IDR/Key frame interval. If not set, this is made equal to gopLength in NV_ENC_CONFIG.Low latency application client can set IDR interval to NVENC_INFINITE_GOPLENGTH so that IDR frames are not inserted automatically."]
    pub idrPeriod: u32,
    #[doc = "< [in]: Specifies the interval between successive intra refresh if enableIntrarefresh is set. Requires enableIntraRefresh to be set."]
    #[doc = "Will be disabled if NV_ENC_CONFIG::gopLength is not set to NVENC_INFINITE_GOPLENGTH."]
    pub intraRefreshPeriod: u32,
    #[doc = "< [in]: Specifies the length of intra refresh in number of frames for periodic intra refresh. This value should be smaller than intraRefreshPeriod"]
    pub intraRefreshCnt: u32,
    #[doc = "< [in]: Specifies the maximum number of references frames in the DPB."]
    pub maxNumRefFramesInDPB: u32,
    #[doc = "< [in]: This parameter in conjunction with the flag enableCustomTileConfig and the array tileWidths[] specifies the way in which the picture is divided into tile columns."]
    #[doc = "When enableCustomTileConfig == 0, the picture will be uniformly divided into numTileColumns tile columns. If numTileColumns is not a power of 2,"]
    #[doc = "it will be rounded down to the next power of 2 value. If numTileColumns == 0, the picture will be coded with the smallest number of vertical tiles as allowed by standard."]
    #[doc = "When enableCustomTileConfig == 1, numTileColumns must be > 0 and <= NV_MAX_TILE_COLS_AV1 and tileWidths must point to a valid array of numTileColumns entries."]
    #[doc = "Entry i specifies the width in 64x64 CTU unit of tile colum i. The sum of all the entries should be equal to the picture width in 64x64 CTU units."]
    pub numTileColumns: u32,
    #[doc = "< [in]: This parameter in conjunction with the flag enableCustomTileConfig and the array tileHeights[] specifies the way in which the picture is divided into tiles rows"]
    #[doc = "When enableCustomTileConfig == 0, the picture will be uniformly divided into numTileRows tile rows. If numTileRows is not a power of 2,"]
    #[doc = "it will be rounded down to the next power of 2 value. If numTileRows == 0, the picture will be coded with the smallest number of horizontal tiles as allowed by standard."]
    #[doc = "When enableCustomTileConfig == 1, numTileRows must be > 0 and <= NV_MAX_TILE_ROWS_AV1 and tileHeights must point to a valid array of numTileRows entries."]
    #[doc = "Entry i specifies the height in 64x64 CTU unit of tile row i. The sum of all the entries should be equal to the picture hieght in 64x64 CTU units."]
    pub numTileRows: u32,
    #[doc = "< [in]: Reserved and must be set to 0."]
    pub reserved2: u32,
    #[doc = "< [in]: If enableCustomTileConfig == 1, tileWidths[i] specifies the width of tile column i in 64x64 CTU unit, with 0 <= i <= numTileColumns -1."]
    pub tileWidths: *mut u32,
    #[doc = "< [in]: If enableCustomTileConfig == 1, tileHeights[i] specifies the height of tile row i in 64x64 CTU unit, with 0 <= i <= numTileRows -1."]
    pub tileHeights: *mut u32,
    #[doc = "< [in]: Specifies the max temporal layer used for hierarchical coding. Cannot be reconfigured and must be specified during encoder creation if temporal layer is considered."]
    pub maxTemporalLayersMinus1: u32,
    #[doc = "< [in]: as defined in section of ISO/IEC 23091-4/ITU-T H.273"]
    pub colorPrimaries: NV_ENC_VUI_COLOR_PRIMARIES,
    #[doc = "< [in]: as defined in section of ISO/IEC 23091-4/ITU-T H.273"]
    pub transferCharacteristics: NV_ENC_VUI_TRANSFER_CHARACTERISTIC,
    #[doc = "< [in]: as defined in section of ISO/IEC 23091-4/ITU-T H.273"]
    pub matrixCoefficients: NV_ENC_VUI_MATRIX_COEFFS,
    #[doc = "< [in]: 0: studio swing representation - 1: full swing representation"]
    pub colorRange: u32,
    #[doc = "< [in]: 0: unknown"]
    #[doc = "1: Horizontally collocated with luma (0,0) sample, between two vertical samples"]
    #[doc = "2: Co-located with luma (0,0) sample"]
    pub chromaSamplePosition: u32,
    #[doc = "< [in]: Specifies the B-Frame as reference mode. Check support for useBFramesAsRef mode using  ::NV_ENC_CAPS_SUPPORT_BFRAME_REF_MODE caps."]
    pub useBFramesAsRef: NV_ENC_BFRAME_REF_MODE,
    #[doc = "< [in]: If enableFilmGrainParams == 1, filmGrainParams must point to a valid NV_ENC_FILM_GRAIN_PARAMS_AV1 structure"]
    pub filmGrainParams: *mut NV_ENC_FILM_GRAIN_PARAMS_AV1,
    #[doc = "< [in]: Specifies max number of forward reference frame used for prediction of a frame. It must be in range 1-4 (Last, Last2, last3 and Golden). It's a suggestive value not necessarily be honored always."]
    pub numFwdRefs: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies max number of L1 list reference frame used for prediction of a frame. It must be in range 1-3 (Backward, Altref2, Altref). It's a suggestive value not necessarily be honored always."]
    pub numBwdRefs: NV_ENC_NUM_REF_FRAMES,
    #[doc = "< [in]: Specifies pixel bit depth of encoded video. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit, NV_ENC_BIT_DEPTH_10 for 10 bit."]
    #[doc = "HW will do the bitdepth conversion internally from inputBitDepth -> outputBitDepth if bit depths differ"]
    #[doc = "Support for 8 bit input to 10 bit encode conversion only"]
    pub outputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: Specifies pixel bit depth of video input. Should be set to NV_ENC_BIT_DEPTH_8 for 8 bit input, NV_ENC_BIT_DEPTH_10 for 10 bit input."]
    pub inputBitDepth: NV_ENC_BIT_DEPTH,
    #[doc = "< [in]: In \"LTR Per Picture\" mode (ltrMarkFrame = 1), ltrNumFrames specifies maximum number of LTR frames in DPB."]
    #[doc = "These ltrNumFrames acts as a guidance to the encoder and are not necessarily honored. To achieve a right balance between the encoding"]
    #[doc = "quality and keeping LTR frames in the DPB queue, the encoder can internally limit the number of LTR frames."]
    #[doc = "The number of LTR frames actually used depends upon the encoding preset being used; Faster encoding presets will use fewer LTR frames."]
    pub ltrNumFrames: u32,
    #[doc = "< [in]: Specifies the number of temporal layers to be used for hierarchical coding."]
    pub numTemporalLayers: u32,
    #[doc = "< [in]: Specifies the strength of temporal filtering. Check support for temporal filter using ::NV_ENC_CAPS_SUPPORT_TEMPORAL_FILTER caps."]
    #[doc = "Temporal filter feature is supported only if frameIntervalP >= 5."]
    #[doc = "If ZeroReorderDelay or enableStereoMVC is enabled, the temporal filter feature is not supported."]
    #[doc = "Temporal filter is recommended for natural contents."]
    pub tfLevel: NV_ENC_TEMPORAL_FILTER_LEVEL,
    #[doc = "< [in]: Reserved and must be set to 0."]
    pub reserved1: [u32; 230usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved3: [*mut ::std::os::raw::c_void; 62usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_AV1() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_AV1>(),
        1552usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_AV1))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_AV1>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CONFIG_AV1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).level as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).tier as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(tier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).minPartSize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(minPartSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).maxPartSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(maxPartSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).idrPeriod as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(idrPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).intraRefreshPeriod as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(intraRefreshPeriod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).intraRefreshCnt as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(intraRefreshCnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).maxNumRefFramesInDPB as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(maxNumRefFramesInDPB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).numTileColumns as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(numTileColumns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).numTileRows as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(numTileRows)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).reserved2 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).tileWidths as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(tileWidths)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).tileHeights as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(tileHeights)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).maxTemporalLayersMinus1 as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(maxTemporalLayersMinus1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).colorPrimaries as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(colorPrimaries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).transferCharacteristics as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(transferCharacteristics)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).matrixCoefficients as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(matrixCoefficients)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).colorRange as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(colorRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).chromaSamplePosition as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(chromaSamplePosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).useBFramesAsRef as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(useBFramesAsRef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).filmGrainParams as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(filmGrainParams)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).numFwdRefs as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(numFwdRefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).numBwdRefs as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(numBwdRefs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).outputBitDepth as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(outputBitDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).inputBitDepth as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(inputBitDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).ltrNumFrames as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(ltrNumFrames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).numTemporalLayers as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(numTemporalLayers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).tfLevel as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(tfLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).reserved1 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CONFIG_AV1>())).reserved3 as *const _ as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_AV1),
            "::",
            stringify!(reserved3)
        )
    );
}
impl Default for _NV_ENC_CONFIG_AV1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_ENC_CONFIG_AV1 {
    #[inline]
    pub fn outputAnnexBFormat(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputAnnexBFormat(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableTimingInfo(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTimingInfo(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableDecoderModelInfo(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableDecoderModelInfo(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableFrameIdNumbers(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableFrameIdNumbers(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableSeqHdr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableSeqHdr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn repeatSeqHdr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_repeatSeqHdr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableIntraRefresh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableIntraRefresh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn chromaFormatIDC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_chromaFormatIDC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn enableBitstreamPadding(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableBitstreamPadding(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableCustomTileConfig(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableCustomTileConfig(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableFilmGrainParams(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableFilmGrainParams(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableLTR(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableLTR(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn enableTemporalSVC(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_enableTemporalSVC(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputMaxCll(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputMaxCll(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn outputMasteringDisplay(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_outputMasteringDisplay(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved4(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_reserved4(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 14u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        outputAnnexBFormat: u32,
        enableTimingInfo: u32,
        enableDecoderModelInfo: u32,
        enableFrameIdNumbers: u32,
        disableSeqHdr: u32,
        repeatSeqHdr: u32,
        enableIntraRefresh: u32,
        chromaFormatIDC: u32,
        enableBitstreamPadding: u32,
        enableCustomTileConfig: u32,
        enableFilmGrainParams: u32,
        enableLTR: u32,
        enableTemporalSVC: u32,
        outputMaxCll: u32,
        outputMasteringDisplay: u32,
        reserved4: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let outputAnnexBFormat: u32 = unsafe { ::std::mem::transmute(outputAnnexBFormat) };
            outputAnnexBFormat as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let enableTimingInfo: u32 = unsafe { ::std::mem::transmute(enableTimingInfo) };
            enableTimingInfo as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let enableDecoderModelInfo: u32 =
                unsafe { ::std::mem::transmute(enableDecoderModelInfo) };
            enableDecoderModelInfo as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let enableFrameIdNumbers: u32 = unsafe { ::std::mem::transmute(enableFrameIdNumbers) };
            enableFrameIdNumbers as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let disableSeqHdr: u32 = unsafe { ::std::mem::transmute(disableSeqHdr) };
            disableSeqHdr as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let repeatSeqHdr: u32 = unsafe { ::std::mem::transmute(repeatSeqHdr) };
            repeatSeqHdr as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let enableIntraRefresh: u32 = unsafe { ::std::mem::transmute(enableIntraRefresh) };
            enableIntraRefresh as u64
        });
        __bindgen_bitfield_unit.set(7usize, 2u8, {
            let chromaFormatIDC: u32 = unsafe { ::std::mem::transmute(chromaFormatIDC) };
            chromaFormatIDC as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let enableBitstreamPadding: u32 =
                unsafe { ::std::mem::transmute(enableBitstreamPadding) };
            enableBitstreamPadding as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let enableCustomTileConfig: u32 =
                unsafe { ::std::mem::transmute(enableCustomTileConfig) };
            enableCustomTileConfig as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let enableFilmGrainParams: u32 =
                unsafe { ::std::mem::transmute(enableFilmGrainParams) };
            enableFilmGrainParams as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let enableLTR: u32 = unsafe { ::std::mem::transmute(enableLTR) };
            enableLTR as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let enableTemporalSVC: u32 = unsafe { ::std::mem::transmute(enableTemporalSVC) };
            enableTemporalSVC as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let outputMaxCll: u32 = unsafe { ::std::mem::transmute(outputMaxCll) };
            outputMaxCll as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let outputMasteringDisplay: u32 =
                unsafe { ::std::mem::transmute(outputMasteringDisplay) };
            outputMasteringDisplay as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let reserved4: u32 = unsafe { ::std::mem::transmute(reserved4) };
            reserved4 as u64
        });
        __bindgen_bitfield_unit.set(18usize, 14u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_AV1"]
#[doc = " AV1 encoder configuration parameters to be set during initialization."]
pub type NV_ENC_CONFIG_AV1 = _NV_ENC_CONFIG_AV1;
#[doc = " \\struct _NV_ENC_CONFIG_H264_MEONLY"]
#[doc = " H264 encoder configuration parameters for ME only Mode"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_H264_MEONLY {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved1: [u32; 255usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved2: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_H264_MEONLY() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_H264_MEONLY>(),
        1536usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_H264_MEONLY))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_H264_MEONLY>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CONFIG_H264_MEONLY))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_MEONLY>())).reserved1 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_MEONLY),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_H264_MEONLY>())).reserved2 as *const _ as usize
        },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_H264_MEONLY),
            "::",
            stringify!(reserved2)
        )
    );
}
impl Default for _NV_ENC_CONFIG_H264_MEONLY {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl _NV_ENC_CONFIG_H264_MEONLY {
    #[inline]
    pub fn disablePartition16x16(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disablePartition16x16(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disablePartition8x16(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disablePartition8x16(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disablePartition16x8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disablePartition16x8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disablePartition8x8(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disablePartition8x8(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disableIntraSearch(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_disableIntraSearch(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bStereoEnable(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bStereoEnable(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 26u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 26u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        disablePartition16x16: u32,
        disablePartition8x16: u32,
        disablePartition16x8: u32,
        disablePartition8x8: u32,
        disableIntraSearch: u32,
        bStereoEnable: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let disablePartition16x16: u32 =
                unsafe { ::std::mem::transmute(disablePartition16x16) };
            disablePartition16x16 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let disablePartition8x16: u32 = unsafe { ::std::mem::transmute(disablePartition8x16) };
            disablePartition8x16 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let disablePartition16x8: u32 = unsafe { ::std::mem::transmute(disablePartition16x8) };
            disablePartition16x8 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disablePartition8x8: u32 = unsafe { ::std::mem::transmute(disablePartition8x8) };
            disablePartition8x8 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let disableIntraSearch: u32 = unsafe { ::std::mem::transmute(disableIntraSearch) };
            disableIntraSearch as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bStereoEnable: u32 = unsafe { ::std::mem::transmute(bStereoEnable) };
            bStereoEnable as u64
        });
        __bindgen_bitfield_unit.set(6usize, 26u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_H264_MEONLY"]
#[doc = " H264 encoder configuration parameters for ME only Mode"]
#[doc = ""]
pub type NV_ENC_CONFIG_H264_MEONLY = _NV_ENC_CONFIG_H264_MEONLY;
#[doc = " \\struct _NV_ENC_CONFIG_HEVC_MEONLY"]
#[doc = " HEVC encoder configuration parameters for ME only Mode"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _NV_ENC_CONFIG_HEVC_MEONLY {
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u32; 256usize],
    #[doc = "< [in]: Reserved and must be set to NULL"]
    pub reserved1: [*mut ::std::os::raw::c_void; 64usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CONFIG_HEVC_MEONLY() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CONFIG_HEVC_MEONLY>(),
        1536usize,
        concat!("Size of: ", stringify!(_NV_ENC_CONFIG_HEVC_MEONLY))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CONFIG_HEVC_MEONLY>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CONFIG_HEVC_MEONLY))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC_MEONLY>())).reserved as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC_MEONLY),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CONFIG_HEVC_MEONLY>())).reserved1 as *const _ as usize
        },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CONFIG_HEVC_MEONLY),
            "::",
            stringify!(reserved1)
        )
    );
}
impl Default for _NV_ENC_CONFIG_HEVC_MEONLY {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " \\struct _NV_ENC_CONFIG_HEVC_MEONLY"]
#[doc = " HEVC encoder configuration parameters for ME only Mode"]
#[doc = ""]
pub type NV_ENC_CONFIG_HEVC_MEONLY = _NV_ENC_CONFIG_HEVC_MEONLY;
#[doc = " \\struct _NV_ENC_CODEC_CONFIG"]
#[doc = " Codec-specific encoder configuration parameters to be set during initialization."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NV_ENC_CODEC_CONFIG {
    #[doc = "< [in]: Specifies the H.264-specific encoder configuration."]
    pub h264Config: NV_ENC_CONFIG_H264,
    #[doc = "< [in]: Specifies the HEVC-specific encoder configuration."]
    pub hevcConfig: NV_ENC_CONFIG_HEVC,
    #[doc = "< [in]: Specifies the AV1-specific encoder configuration."]
    pub av1Config: NV_ENC_CONFIG_AV1,
    #[doc = "< [in]: Specifies the H.264-specific ME only encoder configuration."]
    pub h264MeOnlyConfig: NV_ENC_CONFIG_H264_MEONLY,
    #[doc = "< [in]: Specifies the HEVC-specific ME only encoder configuration."]
    pub hevcMeOnlyConfig: NV_ENC_CONFIG_HEVC_MEONLY,
    #[doc = "< [in]: Reserved and must be set to 0"]
    pub reserved: [u32; 320usize],
}
#[test]
fn bindgen_test_layout__NV_ENC_CODEC_CONFIG() {
    assert_eq!(
        ::std::mem::size_of::<_NV_ENC_CODEC_CONFIG>(),
        1792usize,
        concat!("Size of: ", stringify!(_NV_ENC_CODEC_CONFIG))
    );
    assert_eq!(
        ::std::mem::align_of::<_NV_ENC_CODEC_CONFIG>(),
        8usize,
        concat!("Alignment of ", stringify!(_NV_ENC_CODEC_CONFIG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).h264Config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(h264Config)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).hevcConfig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(hevcConfig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).av1Config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(av1Config)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).h264MeOnlyConfig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(h264MeOnlyConfig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).hevcMeOnlyConfig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(hevcMeOnlyConfig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_NV_ENC_CODEC_CONFIG>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_NV_ENC_CODEC_CONFIG),
            "::",
            stringify!(reserved)
        )
    );
}
impl Default for _NV_ENC_CODEC_CONFIG {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " \\struct _NV_ENC_CODEC_CONFIG"]
#[doc = " Codec-specific encoder configuration parameters to be set during initialization."]
pub type NV_ENC_CODEC_CONFIG = _NV_ENC_CODEC_CONFIG;
#[doc = " \\struct _NV_ENC_CONFIG"]
#[doc = " Encoder configuration parameters to be set during initialization."]
#[repr(C)]
#[derive(Copy, Clone)]
